{
  "intents": [
       {
          "tag": "saludo",
          "patterns": ["Hola", "Buenos dias", "Buenas tardes"],
          "responses": ["¡Hola! ¿Como puedo ayudarte?", "Buenos dias, ¿en que puedo asistirte?", "Buenas tardes, ¿que necesitas?"]
      },
      {
        "tag": "modales",
        "patterns": ["Hola", "como estas ", "estas listo", "estas lisa para trabajar"],
        "responses": ["¿Como puedo ayudarte?", "Estoy bien gracias a Dios , ¿en que puedo asistirte?", "Hola estoy disponible para asistirte , ¿que necesitas?"]
    
      },
      {
          "tag": "despedida",
          "patterns": ["Adios", "Hasta luego", "Nos vemos"],
          "responses": ["Adios, que tengas un buen dia.", "Hasta luego, espero haberte sido de ayuda.", "Nos vemos, ¡gracias por usar nuestro servicio!"]
      },
      {
          "tag": "agradecimiento",
          "patterns": ["Gracias", "Te lo agradezco", "Muy amable"],
          "responses": ["De nada, ¡siempre a tu servicio!", "No hay de que, ¡fue un placer ayudarte!", "Es un placer, ¡estoy aqui para lo que necesites!"]
      },
      {
          "tag": "como_ahorrar_dinero",
          "patterns": ["¿Como puedo ahorrar dinero?", "Consejos para ahorrar", "Quiero ahorrar mas"],
          "responses": ["Puedes ahorrar dinero creando un presupuesto mensual, reduciendo gastos innecesarios y estableciendo un monto fijo para ahorrar cada mes."]
      },
      {
          "tag": "gestion_tiempo",
          "patterns": ["¿Como puedo gestionar mejor mi tiempo?", "Consejos para gestionar el tiempo", "Me cuesta administrar mi tiempo"],
          "responses": ["Para gestionar mejor tu tiempo, utiliza una agenda para planificar tu dias, establece prioridades y elimina distracciones.", "Si te cuesta adminitrar tu tiempo, crea una agenda priorisando lo mas importante por orden"]
      },
      {
          "tag": "inversiones_basicas",
          "patterns": ["¿Donde deberia invertir mi dinero?", "Consejos para invertir", "Mejores inversiones"],
          "responses": ["Para empezar a invertir, considera opciones seguras como fondos indexados, bonos del gobierno o cuentas de ahorro de alto rendimiento."]
      },
      {
          "tag": "mejorar_credito",
          "patterns": ["¿Como puedo mejorar mi puntaje de credito?", "Consejos para el credito", "Mejores practicas de credito"],
          "responses": ["Para mejorar tu puntaje de credito, paga tus deudas a tiempo, manten bajos tus saldos de tarjetas de credito y no solicites nuevas lineas de credito innecesariamente."]
      },
      {
          "tag": "crear_presupuesto",
          "patterns": ["¿Como hago un presupuesto?", "Quiero hacer un presupuesto, que me consejo medas"],
          "responses": ["Para hacer un presupuesto, lista todos tus ingresos y gastos mensuales, asigna un monto a cada categoria y sigue tu plan de gastos estrictamente."]
      },
      {
          "tag": "tipos_seguro",
          "patterns": ["¿Que tipo de seguro necesito?", "Consejos sobre seguros", "Informacion sobre seguros"],
          "responses": ["Dependiendo de tu situacion personal, podrias necesitar un seguros de salud, vida, auto y vivienda. Evalua tus riesgos y necesidades especificas."]
      },
      {
          "tag": "comprar_casa",
          "patterns": ["¿Deberia comprar una casa ahora?", "Consejos para comprar una casa actualmente", "¿Es un buen tiempo para comprar una casa?"],
          "responses": ["Comprar una casa depende de tus finanzas personales y del mercado inmobiliario. Asegurate de tener un buen puntaje de credito y un fondo de emergencia antes de dar este paso."]
      },
      {
          "tag": "fondo_emergencia",
          "patterns": ["¿Como preparo un fondo de emergencia?", "Consejos para un fondo de emergencia", "Quiero crear un fondo de emergencia"],
          "responses": ["Para un fondo de emergencia, ahorra entre 3 a 6 meses de gastos basicos en una cuenta separada y accesible. Contribuye regularmente a este fondo."]
      },
      {
          "tag": "ahorrar_jubilacion ", 
          "patterns": ["¿Como ahorro para la jubilacion?", "Consejos para el retiro", "Quiero planificar mi jubilacion"],
          "responses": ["Para la jubilacion, Asegúrate de estar registrado y contribuyendo a tu cuenta en la Administradora de Fondos de Pensiones (AFP). Explora planes voluntarios ofrecidos por bancos y aseguradoras. Ahorra consistentemente y ajusta tus aportaciones conforme aumenten tus ingresos. Estima tus gastos futuros. "]
      },
      {
          "tag": "educacion_financiera",
          "patterns": ["¿Donde puedo aprender sobre finanzas personales?", "Recursos de educacion financiera", "Quiero mejorar mi conocimiento financiero"],
          "responses": ["Puedes aprender sobre finanzas personales a traves de cursos en linea, libros especializados y consultando con asesores financieros."]
      },
      {
          "tag": "pagar_deudas",
          "patterns": ["¿Como puedo salir de deudas?", "Consejos para pagar deudas", "Me cuesta pagar mis deudas"],
          "responses": ["Para salir de deudas, crea un plan de pagos, prioriza tus deudas con mayor interes y evita acumular nuevas deudas."]
      },
      {
          "tag": "usar_tarjeta_credito",
          "patterns": ["¿Como uso una tarjeta de credito de manera responsable?", "Consejos para usar correctamente las tarjetas de credito", "Mejor uso de tarjetas de credito"],
          "responses": ["Usa tu tarjeta de credito pagando el balance completo cada mes y no gastes mas de lo que puedes pagar."]
      },
      {
          "tag": "ahorrar_meta",
          "patterns": ["¿Como puedo ahorrar para una meta especifica?", "Consejos para metas de ahorro", "Quiero ahorrar para un objetivo"],
          "responses": ["Para ahorrar para una meta especifica, establece un monto objetivo, un plazo y automatiza tus ahorros mensuales."]
      },
      {
          "tag": "mantener_salud_financiera",
          "patterns": ["¿Como mantengo una buena salud financiera?", "Consejos para la salud financiera", "Mejorar mi salud financiera"],
          "responses": ["Manten una buena salud financiera controlando tus gastos, ahorrando regularmente y evitando deudas innecesarias."]
      },
      {
          "tag": "hacer_plan_financiero",
          "patterns": ["¿Como hago un plan financiero?", "Que consejos medas para una buena la planificacion financiera", "Quiero planificar mis finanzas"],
          "responses": ["Un plan financiero debe incluir tus metas, presupuesto, estrategias de ahorro e inversion, y un plan de gestion de deudas."]
      },
      {
          "tag": "empezar_invertir",
          "patterns": ["¿Como empiezo a invertir?", "Primeros pasos para invertir", "Quiero empezar a invertir"],
          "responses": ["Define tus objetivos financieros, tolerancia al riesgo y empieza con opciones diversificadas como fondos indexados o ETFs."]
      },
      {
          "tag": "enseñar_finanzas_niños",
          "patterns": ["¿Como enseño a mis hijos sobre finanzas?", "Educacion financiera para niños", "Quiero enseñar finanzas a mis hijos"],
          "responses": ["Enseña a tus hijos sobre finanzas a traves de ejemplos practicos, juegos educativos y conversaciones sobre el valor del dinero."]
      },
      {
          "tag": "proteger_informacion_financiera",
          "patterns": ["¿Como protejo mi informacion financiera?", "Consejos para la seguridad financiera", "Proteger mis datos financieros"],
          "responses": ["Usa contraseñas seguras, monitorea tus cuentas regularmente y evita compartir tus datos sensibles en linea."]
      },
      {
          "tag": "financiar_negocio",
          "patterns": ["¿Como obtengo financiamiento para mi negocio?", "Opciones de financiamiento para negocios", "Consejos para financiar un negocio"],
          "responses": ["Para financiar tu negocio, considera prestamos bancarios, inversionistas privados o plataformas de crowdfunding."]
      },
      {
          "tag": "ahorrar_vacaciones",
          "patterns": ["¿Como puedo ahorrar para unas vacaciones?", "Consejos para ahorrar en vacaciones", "Quiero ahorrar para viajar"],
          "responses": ["Para ahorrar para vacaciones, establece un presupuesto especifico, ahorra mensualmente y busca ofertas y descuentos para viajes."]
      },
      {
          "tag": "planificar_gastos",
          "patterns": ["¿Como planifico mis gastos mensuales?", "Consejos para planificar gastos", "Quiero planificar mis gastos"],
          "responses": ["Lista tus ingresos y gastos fijos, asigna fondos para gastos variables y ajusta segun tus prioridades y necesidades."]
      },
      {
          "tag": "evitar_deudas",
          "patterns": ["¿Como evito acumular deudas?", "Consejos para evitar deudas", "Quiero evitar deudas"],
          "responses": ["Evita acumular deudas gastando dentro de tus limites o por debajo de ellos, usando tarjetas de credito de manera responsable y ahorrando para compras grandes."]
      },
      {
          "tag": "crear_fondo_jubilacion ",
          "patterns": ["¿Como creo un fondo de jubilacion?", "Consejos para un fondo de jubilacion", "Quiero crear un fondo de jubilacion"],
          "responses": ["Contribuye regularmente a planes de retiro como la AFP y ajusta tus aportaciones conforme aumenten tus ingresos."]
      },
      {
        "tag": "que_es_el_plan_AFPs", 
        "patterns": ["¿Que es el plan de retiro AFPs?", "Es bueno el plan AFPs"],
        "responses": [" El plan de retiro AFPs en la República Dominicana es un sistema de pensiones obligatorio administrado por Administradoras de Fondos de Pensiones (AFPs). el plan AFPs es beneficioso porque asegura que los trabajadores formales tengan un ahorro sistemático para su jubilación, gestionado por profesionales en inversiones. "]
      },

      {
          "tag": "ahorrar_educacion",
          "patterns": ["¿Como ahorro para la educacion de mis hijos?", "Consejos para ahorrar en educacion", "Quiero ahorrar para la universidad de mis hijos"],
          "responses": ["Considera planes de ahorro educativo como el plan 529 o cuentas de ahorro de alto rendimiento y empieza a ahorrar temprano."]
      },
      {
          "tag": "invertir_mercado",
          "patterns": ["¿Como invierto en el mercado de valores?", "Consejos para invertir en acciones", "Quiero invertir en la bolsa"],
          "responses": ["Investiga y selecciona acciones de empresas con buen rendimiento, diversifica tu portafolio y considera inversiones a largo plazo."]
      },
      {
          "tag": "comprar_coche",
          "patterns": ["¿Es buen momento para comprar un coche?", "Aconsejas comprar un coche", "¿Deberia comprar un coche nuevo?"],
          "responses": ["Comprar un coche depende de tu situacion financiera y necesidades. Considera opciones de financiamiento y compara precios antes de decidir."]
      },
      {
          "tag": "reducir_gastos",
          "patterns": ["¿Como puedo reducir mis gastos?", "Consejos para reducir gastos", "Quiero gastar menos"],
          "responses": ["Analiza tus gastos mensuales o semanales, identifica areas donde puedes recortar y establece un presupuesto estricto para evitar gastos innecesarios."]
      },
      {
          "tag": "gestion_deudas",
          "patterns": ["¿Como gestiono mis deudas?", "Consejos para gestionar deudas", "Quiero manejar mejor mis deudas"],
          "responses": ["Haz una lista de tus deudas, prioriza las de mayor interes y considera opciones de consolidacion o refinanciamiento para simplificar pagos."]
      },
      {
          "tag": "inversiones_seguras",
          "patterns": ["¿Cuales son las inversiones mas seguras?", "Consejos para inversiones seguras", "Quiero invertir de forma segura"],
          "responses": ["Las inversiones mas seguras incluyen bonos del gobierno, cuentas de ahorro aseguradas y certificados de deposito (CDs)."]
      },
      {
          "tag": "aprovechar_descuentos",
          "patterns": ["¿Como puedo aprovechar mejor los descuentos?", "Consejos para aprovechar descuentos", "Quiero ahorrar con descuentos"],
          "responses": ["Suscribete a boletines de tiendas, usa cupones y espera promociones especiales como Black Friday para hacer tus compras."]
      },
      {
          "tag": "invertir_bienes_raices",
          "patterns": ["¿Es buena idea invertir en bienes raices?", "Consejos para invertir en bienes raices", "Quiero invertir en propiedades"],
          "responses": ["Invertir en bienes raices puede ser rentable si investigas bien el mercado, eliges propiedades en ubicaciones estrategicas y tienes un plan de gestion claro."]
      },
      {
          "tag": "mejorar_habitos_financieros",
          "patterns": ["¿Como mejoro mis habitos financieros?", "Consejos para mejores habitos financieros", "Quiero mejorar mis habitos con el dinero"],
          "responses": ["Mejora tus habitos financieros llevando un registro de tus gastos, ajustando tu presupuesto regularmente y estableciendo metas claras de ahorro."]
      },

      {
        "tag": "beneficios_tarjeta_credito",
        "patterns": ["¿Cuales son los beneficios de tener una tarjeta de credito?", "Ventajas de usar una tarjeta de credito", "Beneficios de las tarjetas de credito"],
        "responses": ["Las tarjetas de credito ofrecen beneficios como la acumulacion de puntos, mayor seguridad en las compras, y la posibilidad de financiar compras grandes a plazos."]
    },
    {
        "tag": "empezar_negocio",
        "patterns": ["¿Cuales son los pasos para empezar un negocio?", "Como empiezo un negocio", "Pasos para iniciar un negocio"],
        "responses": ["Para empezar un negocio, define tu idea, realiza un estudio de mercado, elabora un plan de negocios, busca financiamiento, y cumple con los requisitos legales necesarios."]
    },
    {
        "tag": "ahorrar_compras_grandes",
        "patterns": ["¿Como puedo ahorrar para compras grandes?", "Consejos para ahorrar para compras importantes", "Quiero ahorrar para una compra grande"],
        "responses": ["Para ahorrar para compras grandes, establece un objetivo de ahorro, ajusta tu presupuesto, y ahorra regularmente en una cuenta separada."]
    },
    {
        "tag": "manejar_gastos_diarios",
        "patterns": ["¿Como manejo mejor mis gastos diarios?", "Consejos para manejar gastos diarios", "Quiero controlar mis gastos diarios"],
        "responses": ["Para manejar mejor tus gastos diarios, lleva un registro detallado de tus gastos, ajusta tu presupuesto segun tus necesidades, y evita compras impulsivas."]
    },
    {
        "tag": "invertir_fondos_mutuos",
        "patterns": ["¿Es buena idea invertir en fondos mutuos?", "Consejos para invertir en fondos mutuos", "Quiero invertir en fondos mutuos"],
        "responses": ["Invertir en fondos mutuos es una buena idea para diversificar tu portafolio y reducir riesgos. Investiga diferentes fondos y elige aquellos con buen historial de rendimiento."]
    },
    {
        "tag": "maximizar_ahorros",
        "patterns": ["¿Como puedo maximizar mis ahorros?", "Consejos para maximizar ahorros", "Quiero aumentar mis ahorros"],
        "responses": ["Maximiza tus ahorros estableciendo metas claras, automatizando tus ahorros y buscando cuentas con altos rendimientos o beneficios adicionales."]
    },
    {
        "tag": "invertir_cripto",
        "patterns": ["¿Es seguro invertir en criptomonedas?", "Conseja invertir en criptomonedas", "Quiero invertir en criptomonedas"],
        "responses": ["Invertir en criptomonedas puede ser rentable, pero tambien conlleva altos riesgos. Investiga bien antes de invertir y no pongas en riesgo mas de lo que puedes permitirte perder."]
    },
    {
        "tag": "reducir_costo_vida",
        "patterns": ["¿Como puedo reducir mi costo de vida?", "Consejos para reducir costo de vida", "Quiero bajar mi costo de vida"],
        "responses": ["Para reducir tu costo de vida, revisa tus gastos fijos, elimina suscripciones innecesarias y busca alternativas mas economicas para tus necesidades diarias."]
    },
    {
        "tag": "beneficios_ahorro_automatico",
        "patterns": ["¿Cuales son los beneficios del ahorro automatico?", "Ventajas del ahorro automatico", "Beneficios de automatizar ahorros"],
        "responses": ["El ahorro automatico te ayuda a mantener consistencia en tus ahorros, reduce la tentacion de gastar y facilita la acumulacion de fondos para tus metas financieras."]
    },
    {
      "tag": "invertir_arte",
      "patterns": ["¿Es buena idea invertir en arte?", "Consejos para invertir en arte", "Quiero invertir en obras de arte"],
      "responses": ["Invertir en arte puede ser lucrativo, pero es importante investigar el mercado, comprar obras de artistas reconocidos y considerar los costos de almacenamiento y seguros."]
  },
  {
      "tag": "crear_fondo_vacaciones",
      "patterns": ["¿Como creo un fondo para vacaciones?", "Consejos para ahorrar para vacaciones", "Quiero ahorrar para un viaje"],
      "responses": ["Para crear un fondo para vacaciones, establece un objetivo de ahorro, planifica con anticipacion y ahorra una cantidad fija regularmente."]
  },
  {
      "tag": "evitar_fraude_tarjeta_credito",
      "patterns": ["¿Como evito el fraude con mi tarjeta de credito?", "Consejos para prevenir fraude con tarjeta de credito", "Quiero proteger mi tarjeta de credito"],
      "responses": ["Para evitar el fraude con tu tarjeta de credito, utiliza contraseñas seguras, monitorea tus estados de cuenta regularmente y evita compartir tu informacion en sitios no seguros o a terceros."]
  },
  {
      "tag": "invertir_inmuebles_comerciales",
      "patterns": ["¿Es buena idea invertir en inmuebles comerciales?", "Consejos para invertir en inmuebles comerciales", "Quiero invertir en propiedades comerciales", "Es buena idea invertir en inmuebles comerciales"],
      "responses": ["Invertir en inmuebles comerciales puede generar altos rendimientos si eliges ubicaciones estrategicas y mantienes buenos inquilinos. Considera los costos de mantenimiento y administracion."]
  },
  {
      "tag": "crear_fondo_emergencia",
      "patterns": ["¿Como puedo crear un fondo de emergencia?", "Consejos para un fondo de emergencia", "Quiero tener un fondo de emergencia"],
      "responses": ["Crea un fondo de emergencia ahorrando entre 3 a 6 meses de tus gastos basicos en una cuenta separada y accesible."]
  },
  {
      "tag": "reducir_deuda_tarjeta_credito",
      "patterns": ["¿Como puedo reducir la deuda de mi tarjeta de credito?", "Consejos para pagar deudas de tarjeta de credito", "Quiero pagar mi tarjeta de credito"],
      "responses": ["Para reducir la deuda de tu tarjeta de credito, prioriza los pagos con mayor interes, paga mas del minimo y evita hacer nuevas compras hasta saldar la deuda."]
  },
  {
      "tag": "beneficios_ahorro_educacion",
      "patterns": ["¿Cuales son los beneficios de ahorrar para la educacion?", "Ventajas de un fondo de ahorro para educacion", "Beneficios de ahorrar para la educacion"],
      "responses": ["Ahorrar para la educacion ofrece la tranquilidad de tener fondos disponibles para cubrir los costos educativos, y algunas cuentas de ahorro educativo tienen beneficios fiscales."]
  },
  {
      "tag": "invertir_etfs",
      "patterns": ["¿Es buena idea invertir en ETFs?", "Consejos para invertir en ETFs", "Quiero invertir en fondos cotizados"],
      "responses": ["Invertir en ETFs es una buena manera de diversificar tu portafolio con costos bajos y exposicion a diferentes mercados y sectores."]
  },
      {
        "tag": "estrategias_inversion",
        "patterns": ["¿Que estrategias de inversion debo considerar?", "Dime algunas estrategias para invertir", "Estrategias de inversion para principiantes"],
        "responses": ["Considera estrategias de inversion diversificadas, invierte a largo plazo y evalua tu tolerancia al riesgo antes de tomar decisiones."]
      },
      {
        "tag": "seguros_necesarios",
        "patterns": ["¿Que seguros son esenciales?", "¿Que tipo de seguros deberia tener?", "Seguros imprescindibles"],
        "responses": ["Es esencial contar con seguro de salud, seguro de vida, seguro de automovil y seguro de hogar, dependiendo de tus circunstancias personales y activos."]
      },
      {
        "tag": "rentabilidad_fondos_inversion",
        "patterns": ["¿Como se mide la rentabilidad de los fondos de inversion?", "Rentabilidad en fondos de inversion", "¿Que rentabilidad esperar de un fondo de inversion?"],
        "responses": ["La rentabilidad de los fondos de inversion se mide por el porcentaje de ganancia o perdida sobre la inversion original, considerando el rendimiento y los dividendos."]
      },
      {
        "tag": "ahorro_eficiente",
        "patterns": ["¿Como puedo ahorrar de manera eficiente?", "Metodos eficientes para ahorrar", "¿Como maximizo mi ahorro?"],
        "responses": ["Para ahorrar de manera eficiente, automatiza tus ahorros, revisa regularmente tus gastos y ajusta tu presupuesto para maximizar el ahorro."]
      },
      {
        "tag": "costos_ocultos_compras",
        "patterns": ["¿Que costos ocultos debo considerar al comprar algo?", "Costos ocultos en compras", "¿Como identificar costos ocultos?"],
        "responses": ["Al comprar, considera costos adicionales como impuestos, tarifas de envio, mantenimiento y otros gastos no incluidos en el precio de etiqueta."]
      },
      {
        "tag": "cuentas_retiro",
        "patterns": ["¿Que tipos de cuentas de retiro existen?", "Cuentas de retiro recomendadas", "Opciones de cuentas para la jubilacion"],
        "responses": ["Existen diversas cuentas de retiro como la AFP, SDSS, Planes de Ahorro Privado(Servicio ofrecido por bancos) y planes de pension, cada una con sus propias ventajas fiscales y condiciones."]
      },
      {
        "tag": "evaluar_asesor_financiero",
        "patterns": ["¿Como evaluar a un asesor financiero?", "Elegir un asesor financiero", "Criterios para seleccionar asesor financiero"],
        "responses": ["Evalua un asesor financiero basado en sus credenciales, experiencia, estructura de tarifas y opiniones de clientes anteriores."]
      },
      {
        "tag": "inversiones_altas_rentabilidades",
        "patterns": ["¿Que inversiones ofrecen altas rentabilidades?", "Inversiones con alta rentabilidad", "¿Donde invertir para altos retornos?"],
        "responses": ["Inversiones como el mercado de valores, bienes raices y ciertas criptomonedas pueden ofrecer altas rentabilidades, pero tambien implican mayores riesgos."]
      },
      {
        "tag": "plan_financiero_personal",
        "patterns": ["¿Como creo un plan financiero personal?", "Elaborar un plan financiero", "Pasos para un plan financiero personal"],
        "responses": ["Identifica tus metas financieras, evalua tus ingresos y gastos, establece un presupuesto, y planifica inversiones y ahorros para alcanzar tus objetivos."]
      },
      {
        "tag": "gestionar_gastos_impulsivos",
        "patterns": ["¿Como manejo gastos impulsivos?", "Controlar compras por impulso", "Evitar gastos impulsivos"],
        "responses": ["Para manejar gastos impulsivos, establece un presupuesto, evita usar tarjetas de credito para compras diarias, y espera 24 horas antes de realizar compras grandes."]
      },
      {
        "tag": "invertir_oro_plata",
        "patterns": ["¿Es buena idea invertir en oro y plata?", "Invertir en metales preciosos", "¿Deberia comprar oro o plata?"],
        "responses": ["Invertir en oro y plata puede ser una buena forma de diversificar tu portafolio y protegerte contra la inflacion, pero considera la volatilidad de los precios de estos metales."]
      },
      {
        "tag": "finanzas_pareja",
        "patterns": ["¿Como gestionar las finanzas en pareja?", "Finanzas conjuntas con mi pareja", "Consejos para finanzas de pareja"],
        "responses": ["Para gestionar finanzas en pareja, comunica claramente tus metas y presupuestos, establece cuentas conjuntas y personales, y planea juntos para el futuro."]
      },
      {
        "tag": "seguridad_financiera_futuro",
        "patterns": ["¿Como aseguro mi seguridad financiera para el futuro?", "Planificar la seguridad financiera", "Construir un futuro financiero seguro"],
        "responses": ["Asegura tu futuro financiero ahorrando e invirtiendo consistentemente, diversificando tus inversiones y planificando para la jubilacion y emergencias."]
      },
      {
        "tag": "beneficios_inversion_indexada",
        "patterns": ["¿Cuales son los beneficios de la inversion indexada?", "Inversion indexada", "Ventajas de los fondos indexados"],
        "responses": ["La inversion indexada ofrece bajo costo, diversificacion automatica y rendimientos consistentes al seguir un indice de mercado, como el S&P 500."]
      },
      {
        "tag": "riesgos_inversion",
        "patterns": ["¿Cuales son los riesgos de invertir?", "Identificar riesgos en inversiones", "Riesgos comunes en inversiones"],
        "responses": ["Los riesgos de invertir incluyen la perdida de capital, volatilidad del mercado, riesgo de liquidez y riesgos especificos del sector o empresa."]
      },
      {
        "tag": "planificar_gastos_futuros",
        "patterns": ["¿Como planifico para gastos futuros?", "Prepararse para gastos grandes", "Planificacion financiera para gastos futuros"],
        "responses": ["Para planificar gastos futuros, identifica tus necesidades a largo plazo, establece fondos de ahorro especificos y ajusta tu presupuesto para acumular fondos."]
      },
      {
        "tag": "invertir_startups",
        "patterns": ["¿Es buena idea invertir en startups?", "Invertir en empresas emergentes", "Riesgos y beneficios de invertir en startups"],
        "responses": ["Invertir en startups puede ofrecer altos retornos, pero tambien implica riesgos elevados. Investiga la empresa, el mercado y su potencial de crecimiento antes de invertir."]
      },
      {
        "tag": "importancia_diversificacion",
        "patterns": ["¿Por que es importante diversificar inversiones?", "Beneficios de la diversificacion inversiones", "¿Como diversificar mi portafolio?"],
        "responses": ["La diversificacion reduce el riesgo al esparcir inversiones en diferentes activos, sectores y geografias, protegiendo tu portafolio contra volatilidades especificas."]
      },
      {
        "tag": "ahorro_energia",
        "patterns": ["¿Como puedo ahorrar en mi factura de energia?", "Reducir costos de energia", "Consejos para ahorrar electricidad"],
        "responses": ["Para ahorrar en energia, utiliza aparatos eficientes ode bajo consumo, ajusta tu termostato de la nevera, y apaga luces y equipos cuando no los estes usando."]
      },
      {
        "tag": "finanzas_salud_mental",
        "patterns": ["¿Como afectan las finanzas en la salud mental?", "Impacto de las finanzas en el bienestar", "Relacion entre dinero y salud mental"],
        "responses": ["Las finanzas pueden afectar significativamente la salud mental, causando estres o ansiedad si no se gestionan bien. Es crucial mantener un equilibrio y buscar asesoria si es necesario."]
      },
      {
        "tag": "ahorrar_cambio_climatico",
        "patterns": ["¿Como puedo ahorrar dinero y contribuir contra el cambio climatico?", "Ahorrar dinero y ayudar al planeta", "Economia verde y ahorro"],
        "responses": ["Para ahorrar dinero y combatir el cambio climatico, invierte en productos sostenibles, reduce el uso de recursos y apoya empresas con practicas ecologicas."]
      },
      {
        "tag": "preparar_crisis_economica",
        "patterns": ["¿Como me preparo para una crisis economica?", "Preparativos para recesion", "Estrategias financieras para tiempos de crisis"],
        "responses": ["Para prepararte para una crisis economica, fortalece tu fondo de emergencia, diversifica tus inversiones y reduce gastos no esenciales."]
      },
      {
        "tag": "financiamiento_educacion",
        "patterns": ["¿Que opciones de financiamiento existen para la educacion?", "Como financiar estudios superiores", "Ayudas financieras para estudiantes"],
        "responses": ["Las opciones de financiamiento educativo incluyen becas, prestamos estudiantiles, ayudas gubernamentales y programas de trabajo-estudio."]
      },
      {
        "tag": "seguros_viaje",
        "patterns": ["¿Debo contratar un seguro de viaje?", "Beneficios del seguro de viaje", "¿Es necesario un seguro para viajar?"],
        "responses": ["Contratar un seguro de viaje es recomendable para cubrir imprevistos como enfermedades, accidentes o cancelaciones durante tus viajes."]
      },
      {
        "tag": "estrategias_reduccion_deudas",
        "patterns": ["¿Cuales son las mejores estrategias para reducir deudas?", "Como salir del endeudamiento", "Plan para reducir mis deudas"],
        "responses": ["Para reducir deudas, considera estrategias como el metodo de la bola de nieve (pagar deudas de menor a mayor) o el metodo avalancha (priorizar deudas con mayor interes)."]
      },
      {
        "tag": "planificacion_sucesoria",
        "patterns": ["¿Que es la planificacion sucesoria?", "Importancia de la planificacion sucesoria", "Como preparar un plan sucesorio"],
        "responses": ["La planificacion sucesoria implica preparar documentos legales como testamentos y fideicomisos para gestionar y distribuir tu patrimonio despues de tu fallecimiento."]
      },
      {
        "tag": "invertir_bonos",
        "patterns": ["¿Es buena idea invertir en bonos?", "Invertir en bonos gubernamentales", "Beneficios de los bonos como inversion"],
        "responses": ["Invertir en bonos puede ser una opcion segura y estable, especialmente los bonos gubernamentales, que ofrecen retornos fijos y menos riesgo que las acciones."]
      },
      {
        "tag": "educacion_financiera_escuelas",
        "patterns": ["¿Deberia enseñarse educacion financiera en las escuelas?", "Importancia de la educacion financiera temprana", "Finanzas en el curriculo escolar"],
        "responses": ["La educacion financiera en las escuelas es crucial para preparar a los jovenes para gestionar su dinero de manera efectiva y tomar decisiones informadas."]
      },
      {
        "tag": "evitar_multas_financieras",
        "patterns": ["¿Como puedo evitar multas financieras?", "Evitar costos por demoras o multas", "Consejos para no incurrir en multas"],
        "responses": ["Para evitar multas financieras, paga tus cuentas a tiempo, revisa los terminos de contratos y manten informada a tu institucion financiera sobre cualquier cambio."]
      },
      {
        "tag": "ahorrar_tecnologia",
        "patterns": ["¿Como ahorro en compras tecnologicas?", "Reducir gastos en tecnologia", "Consejos para comprar tecnologia"],
        "responses": ["Para ahorrar en tecnologia, espera ofertas y descuentos, considera comprar modelos anteriores o reacondicionados, y evalua realmente tus necesidades antes de comprar."]
      },
      {
        "tag": "fraude_financiero_online",
        "patterns": ["¿Como protegerme del fraude financiero online?", "Evitar estafas en internet", "Seguridad financiera en linea"],
        "responses": ["Protege tu informacion financiera usando contraseñas fuertes, verificando la seguridad de sitios web antes de realizar transacciones y no compartiendo datos sensibles."]
      },
      {
        "tag": "negociar_salarios",
        "patterns": ["¿Como puedo negociar un salario mas alto?", "Estrategias para negociar mi salario", "Consejos para negociacion salarial"],
        "responses": ["Para negociar un salario mas alto, prepara argumentos basados en tu valor y contribuciones, conoce el rango salarial de tu posicion y muestra flexibilidad en otros beneficios."]
      },
      {
        "tag": "cambios_fiscales",
        "patterns": ["¿Como me afectan los cambios fiscales?", "Impacto de las reformas fiscales", "Adaptarse a cambios en la legislacion fiscal"],
        "responses": ["Los cambios fiscales pueden afectar tus ingresos disponibles, obligaciones tributarias y estrategias de inversion. Es importante estar informado y consultar con un asesor fiscal."]
      },
      {
        "tag": "seguridad_social",
        "patterns": ["¿Que debo saber sobre la Seguridad Social?", "Beneficios de la Seguridad Social", "Como funciona la Seguridad Social"],
        "responses": ["La Seguridad Social proporciona beneficios de jubilacion, discapacidad, y sobreviviente, basados en tus años de trabajo y contribuciones."]
      },
      {
        "tag": "tarjetas_credito_debito",
        "patterns": ["¿Cual es la diferencia entre tarjeta de credito y debito?", "Tarjeta de credito vs debito", "Beneficios de credito y debito"],
        "responses": ["Las tarjetas de credito te permiten pedir prestado y pagar mas tarde, mientras que las de debito deducen dinero directamente de tu cuenta bancaria."]
      },
      {
        "tag": "prestamos_hipotecarios",
        "patterns": ["¿Como funcionan los prestamos hipotecarios?", "Obtener un prestamo para casa", "Tipos de hipotecas disponibles"],
        "responses": ["Los prestamos hipotecarios te permiten financiar la compra de una propiedad pagando un anticipo y luego cuotas mensuales con intereses a lo largo de varios años."]
      },
      {
        "tag": "mejorar_historial_crediticio",
        "patterns": ["¿Como puedo mejorar mi historial crediticio?", "Mejorar mi calificacion de credito", "Construir un buen credito"],
        "responses": ["Mejora tu historial crediticio haciendo pagos a tiempo, utilizando un porcentaje bajo de tu credito disponible y manteniendo cuentas de credito antiguas."]
      },
      {
        "tag": "inversiones_sostenibles",
        "patterns": ["¿Que son las inversiones sostenibles?", "Invertir de manera sostenible", "Opciones de inversion ecologica"],
        "responses": ["Las inversiones sostenibles buscan generar impacto social o ambiental positivo ademas de retornos financieros, como en energias renovables o empresas socialmente responsables."]
      },
      {
        "tag": "beneficios_fiscales_ahorro",
        "patterns": ["¿Que beneficios fiscales puedo obtener al ahorrar?", "Incentivos fiscales para ahorrar", "Ahorro y ventajas fiscales"],
        "responses": ["Algunos planes de ahorro ofrecen beneficios fiscales como deducciones o exenciones tributarias, especialmente en cuentas de retiro y educacion."]
      },
      {
        "tag": "riesgos_inversion_inmobiliaria",
        "patterns": ["¿Cuales son los riesgos de invertir en inmuebles?", "Riesgos de la inversion inmobiliaria", "Invertir en bienes raices con precaucion"],
        "responses": ["Los riesgos de invertir en inmuebles incluyen la falta de liquidez, fluctuaciones del mercado, costos de mantenimiento y posibles vacantes en las propiedades."]
      },
      {
        "tag": "inversion_bolsa_valores",
        "patterns": ["¿Como empiezo a invertir en la bolsa de valores?", "Pasos para invertir en bolsa", "Iniciar en el mercado de valores"],
        "responses": ["Para invertir en la bolsa, abre una cuenta de corretaje, educa sobre el mercado de valores, y comienza con inversiones pequeñas y diversificadas."]
      },
      {
        "tag": "seguros_para_negocios",
        "patterns": ["¿Que seguros necesito para mi negocio?", "Tipos de seguros comerciales", "Seguros imprescindibles para empresas"],
        "responses": ["Tu negocio puede necesitar seguros como responsabilidad civil, propiedad comercial, vehiculos comerciales y compensacion a trabajadores, dependiendo de la naturaleza del negocio."]
      },
      {
        "tag": "finanzas_responsables",
        "patterns": ["¿Como practico finanzas responsables?", "Ser financieramente responsable", "Habitos de finanzas responsables"],
        "responses": ["Practica finanzas responsables creando y siguiendo un presupuesto, evitando deudas innecesarias, y planificando para el futuro con ahorros e inversiones."]
      },
      {
        "tag": "comprar_vivienda",
        "patterns": ["¿Que debo considerar al comprar una vivienda?", "Consejos para la compra de un hogar", "Preparativos para comprar casa"],
        "responses": ["Al comprar una vivienda, considera tu presupuesto, el tamaño y ubicacion de la propiedad, los costos de mantenimiento y los impuestos a la propiedad."]
      },
      {
        "tag": "cuentas_bancarias_extranjero",
        "patterns": ["¿Debo abrir cuentas bancarias en el extranjero?", "Beneficios y riesgos de cuentas en el extranjero", "Cuentas bancarias internacionales"],
        "responses": ["Abrir cuentas bancarias en el extranjero puede ofrecer beneficios como diversificacion y conveniencia en viajes, pero considera las regulaciones fiscales y legales."]
      },
      {
        "tag": "planificar_retiro",
        "patterns": ["¿Como planifico mi retiro?", "Estrategias para un retiro seguro", "Preparacion para la jubilacion"],
        "responses": ["Planifica tu retiro determinando tus necesidades futuras, maximizando aportes a cuentas de retiro y considerando inversiones que generen ingresos estables."]
      },
      {
        "tag": "ahorrar_comida",
        "patterns": ["¿Como puedo ahorrar dinero en alimentos?", "Reducir gastos en comestibles", "Consejos para ahorrar en la cocina"],
        "responses": ["Para ahorrar en alimentos, compra en bulk, utiliza cupones, prepara comidas en casa y evita desperdicios planificando tus comidas."]
      },
      {
        "tag": "invertir_educacion_hijos",
        "patterns": ["¿Como invierto en la educacion de mis hijos?", "Financiar estudios de los hijos", "Ahorro para la educacion superior"],
        "responses": ["Para invertir en la educacion de tus hijos, considera planes de ahorro educativos, becas y prestamos estudiantiles, y comienza a ahorrar a tiempo."]
      },
      {
        "tag": "impuestos_inversiones",
        "patterns": ["¿Como afectan los impuestos a mis inversiones?", "Impuestos sobre ganancias de capital", "Planificacion fiscal de inversiones"],
        "responses": ["Los impuestos pueden reducir tus rendimientos de inversion. Considera estrategias como cuentas de retiro con ventajas fiscales y ten en cuenta el tiempo de tenencia de tus inversiones."]
      },
      {
        "tag": "prestamos_personales",
        "patterns": ["¿Cuando debo considerar un prestamo personal?", "Usos de prestamos personales", "Consejos para prestamos personales"],
        "responses": ["Considera un prestamo personal para gastos grandes o consolidacion de deudas. Compara tasas de interes y terminos, y asegurate de tener un plan de pago."]
      },
      {
        "tag": "gestion_financiera_familia",
        "patterns": ["¿Como gestiono las finanzas familiares?", "Finanzas del hogar", "Planificar el presupuesto familiar"],
        "responses": ["Gestiona las finanzas familiares estableciendo un presupuesto comun, discutiendo metas financieras y asignando responsabilidades para gastos e inversiones."]
      },
      {
        "tag": "invertir_futuros",
        "patterns": ["¿Que son los futuros y Como puedo invertir en ellos?", "Invertir en contratos futuros", "Mercado de futuros"],
        "responses": ["Los futuros son contratos para comprar o vender activos en una fecha futura a un precio acordado. Es un mercado volatil y se recomienda para inversores experimentados."]
      },
      {
        "tag": "evitar_impago_credito",
        "patterns": ["¿Como evito el impago de mi credito?", "Prevenir la morosidad en creditos", "Consejos para no caer en impago"],
        "responses": ["Para evitar el impago de creditos, asegurate de entender los terminos de tu prestamo, realiza pagos a tiempo y comunicate con tu prestamista si enfrentas dificultades financieras."]
      },
      {
        "tag": "comparar_seguros",
        "patterns": ["¿Como comparo diferentes seguros?", "Elegir el mejor seguro", "Comparacion de polizas de seguros"],
        "responses": ["Para comparar seguros, evalua las coberturas ofrecidas, compara costos de las primas, revisa las exclusiones y considera la reputacion del proveedor."]
      },
      {
        "tag": "inversiones_renovables",
        "patterns": ["¿Es buena idea invertir en energias renovables?", "Invertir en el sector de energias verdes", "Oportunidades de inversion en renovables"],
        "responses": ["Invertir en energias renovables puede ser prometedor debido a la creciente demanda de soluciones sostenibles y apoyo gubernamental, aunque es importante considerar los riesgos especificos del sector."]
      },
      {
        "tag": "ahorro_impuestos",
        "patterns": ["¿Como puedo ahorrar en impuestos?", "Estrategias para reducir la carga fiscal", "Consejos fiscales para ahorrar dinero"],
        "responses": ["Para ahorrar en impuestos, aprovecha todas las deducciones y creditos fiscales disponibles, invierte en cuentas de retiro y planifica tus ventas de activos."]
      },
      {
        "tag": "tarjetas_credito_viajes",
        "patterns": ["¿Cuales son las mejores tarjetas de credito para viajar?", "Tarjetas de credito con beneficios de viaje", "Elegir tarjeta para viajeros"],
        "responses": ["Las mejores tarjetas de credito para viajar ofrecen beneficios como millas aereas, acceso a salas VIP en aeropuertos y seguros de viaje sin costo adicional."]
      },
      {
        "tag": "preparar_jubilacion_anticipada",
        "patterns": ["¿Como me preparo para una jubilacion anticipada?", "Planear para retirarse temprano", "Estrategias para jubilacion anticipada"],
        "responses": ["Para una jubilacion anticipada, maximiza tus ahorros, invierte agresivamente mientras joven, y planifica metodos para acceder a fondos antes de la edad de jubilacion sin penalizaciones."]
      },
      {
        "tag": "recuperar_credito_danado",
        "patterns": ["¿Como puedo recuperar un credito dañado?", "Reparar historial crediticio", "Mejorar credito despues de problemas"],
        "responses": ["Para recuperar un credito dañado, comienza por revisar tu reporte de credito, corrige errores, paga deudas pendientes y usa nuevas lineas de credito responsablemente."]
      },
      {
        "tag": "finanzas_divorcio",
        "patterns": ["¿Como manejar las finanzas durante un divorcio?", "Separacion de bienes en divorcio", "Consejos financieros para el divorcio"],
        "responses": ["Durante un divorcio, es crucial hacer un inventario completo de activos y deudas conjuntas, establecer un presupuesto individual y buscar asesoramiento legal y financiero."]
      },
      {
        "tag": "invertir_dividendos",
        "patterns": ["¿Como funcionan las inversiones que generan dividendos?", "Invertir para recibir dividendos", "Acciones con dividendos"],
        "responses": ["Las inversiones que generan dividendos incluyen acciones de empresas que pagan una parte de sus ganancias regularmente. Son una fuente de ingresos pasivos, pero es importante evaluar la estabilidad de la empresa."]
      },
      {
        "tag": "ahorro_plan_college",
        "patterns": ["¿Que es un plan 529?", "Ahorro para la universidad con plan 529", "Beneficios de los planes 529 para educacion"],
        "responses": ["Un plan 529 es un plan de ahorro para la educacion que ofrece beneficios fiscales. Puedes usar los fondos para pagar matricula, libros y otros gastos educativos calificados."]
      },
      {
        "tag": "evaluar_fondos_inversion",
        "patterns": ["¿Como evaluo fondos de inversion para elegir los mejores?", "Seleccionar fondos de inversion", "Criterios para evaluar fondos"],
        "responses": ["Evalua fondos de inversion basandote en su rendimiento historico, tarifas y comisiones, estrategia de inversion y calificaciones de riesgo."]
      },
      {
        "tag": "ahorro_combustible",
        "patterns": ["¿Como puedo ahorrar en combustible?", "Reducir gastos de gasolina", "Consejos para economizar combustible"],
        "responses": ["Para ahorrar combustible, manten tu vehiculo bien afinado, usa neumaticos con la presion adecuada, y evita aceleraciones y frenados bruscos."]
      },
      {
        "tag": "beneficios_cuentas_retiro",
        "patterns": ["¿Cuales son los beneficios de las cuentas de retiro?", "Ventajas de ahorrar para la jubilacion", "Por que abrir una cuenta de retiro"],
        "responses": ["Las cuentas de retiro ofrecen beneficios fiscales, como deducciones tributarias y crecimiento de inversiones libre de impuestos, ayudando a maximizar tus ahorros para la jubilacion."]
      },
      {
        "tag": "invertir_bienes_raices_internacionales",
        "patterns": ["¿Deberia invertir en bienes raices internacionales?", "Invertir en propiedades en el extranjero", "Riesgos de bienes raices internacionales"],
        "responses": ["Invertir en bienes raices internacionales puede ofrecer diversificacion y potencial de crecimiento, pero implica desafios como barreras legales y diferencias culturales."]
      },
      {
        "tag": "gestion_riesgos_financieros",
        "patterns": ["¿Como gestiono los riesgos financieros?", "Estrategias para manejar riesgos financieros", "Reducir riesgos en finanzas"],
        "responses": ["Gestiona riesgos financieros diversificando tus inversiones, estableciendo un fondo de emergencia, y utilizando seguros para proteger tus activos."]
      },
      {
        "tag": "prestamos_estudiantes_internacionales",
        "patterns": ["¿Existen prestamos para estudiantes internacionales?", "Financiamiento para estudiantes de otros paises", "Prestamos para educacion internacional"],
        "responses": ["Existen prestamos para estudiantes internacionales ofrecidos por instituciones privadas y programas especificos, aunque suelen requerir un aval o co-firmante en el pais de estudio."]
      },
      {
        "tag": "ahorrar_gas_natural",
        "patterns": ["¿Como puedo reducir mi consumo de gas natural?", "Ahorrar en la factura de gas", "Consejos para usar menos gas"],
        "responses": ["Para reducir el consumo de gas natural, aisla tu hogar, ajusta el termostato a una temperatura moderada y realiza mantenimiento regular de tu sistema de calefaccion."]
      },
      {
        "tag": "seguros_para_jovenes",
        "patterns": ["¿Que seguros deberian considerar los jovenes?", "Seguros para menores de 30", "Polizas recomendadas para jovenes"],
        "responses": ["Los jovenes deberian considerar seguros de salud, de automoviles, y de vida, especialmente si tienen dependientes o deudas significativas."]
      },
      {
        "tag": "consolidar_deudas",
        "patterns": ["¿Que es la consolidacion de deudas?", "Consolidar mis deudas", "Como funciona la consolidacion de deudas"],
        "responses": ["La consolidacion de deudas implica combinar varias deudas en un solo prestamo con una tasa de interes mas baja, facilitando la gestion y el pago."]
      },
      {
        "tag": "seguros_mascotas",
        "patterns": ["¿Vale la pena tener un seguro para mascotas?", "Seguros para animales domesticos", "Beneficios del seguro de mascotas"],
        "responses": ["Un seguro para mascotas puede ser valioso para cubrir costos de tratamientos veterinarios, especialmente en casos de enfermedad o accidentes."]
      },
      {
        "tag": "invertir_empresa_privada",
        "patterns": ["¿Como invierto en una empresa privada?", "Invertir en negocios no cotizados", "Participar en capital privado"],
        "responses": ["Invertir en una empresa privada generalmente requiere ser un inversor acreditado. Implica comprar acciones o participaciones y asumir un riesgo significativo."]
      },
      {
        "tag": "comprar_seguros_online",
        "patterns": ["¿Es seguro comprar seguros por internet?", "Comprar polizas de seguro online", "Riesgos de seguros en linea"],
        "responses": ["Comprar seguros en linea puede ser seguro si usas sitios de compañias aseguradoras reconocidas y verificas su autenticidad y politicas de privacidad."]
      },
      {
        "tag": "retirar_dinero_retiro_anticipado",
        "patterns": ["¿Como retiro dinero de mi fondo de retiro antes de tiempo?", "Penalidades por retiro anticipado", "Acceder a fondos de jubilacion temprano"],
        "responses": ["Retirar dinero de un fondo de retiro antes de la edad permitida puede conllevar impuestos y penalidades. Considera alternativas como prestamos contra tu retiro o retiros por dificultades."]
      },
      {
        "tag": "invertir_acuicultura",
        "patterns": ["¿Es buena idea invertir en acuicultura?", "Invertir en la industria del mar", "Potencial de la acuicultura como inversion"],
        "responses": ["Invertir en acuicultura puede ser prometedor debido a la creciente demanda de productos marinos sostenibles, pero requiere comprension de los riesgos ecologicos y regulatorios."]
      },
      {
        "tag": "ahorro_comunitario",
        "patterns": ["¿Que es el ahorro comunitario?", "Beneficios de ahorrar en grupo", "Como funciona el ahorro grupal"],
        "responses": ["El ahorro comunitario implica grupos de personas que ahorran dinero juntas, lo cual puede proporcionar un sistema de apoyo y mejorar las tasas de ahorro de los miembros."]
      },
      {
        "tag": "comprar_auto_usado",
        "patterns": ["¿Que debo considerar al comprar un auto usado?", "Consejos para comprar vehiculos de segunda mano", "Inspeccionar un auto usado antes de comprar"],
        "responses": ["Al comprar un auto usado, revisa el historial del vehiculo, realiza una inspeccion mecanica, compara precios y prueba el auto antes de comprarlo."]
      },
      {
        "tag": "seguros_estudiantes",
        "patterns": ["¿Los estudiantes necesitan algun tipo de seguro?", "Seguros recomendados para estudiantes", "Polizas de seguros para la vida universitaria"],
        "responses": ["Los estudiantes pueden beneficiarse de seguros de salud, de propiedad personal y de responsabilidad civil, especialmente si viven fuera del hogar o estudian en el extranjero."]
      },
      {
        "tag": "finanzas_despues_jubilacion",
        "patterns": ["¿Como gestiono mis finanzas despues de jubilarme?", "Finanzas en la jubilacion", "Manejo de dinero en la tercera edad"],
        "responses": ["Gestiona tus finanzas en la jubilacion estableciendo un presupuesto basado en ingresos fijos, invirtiendo conservadoramente y planificando gastos de salud a largo plazo."]
      },
      {
        "tag": "invertir_infraestructura",
        "patterns": ["¿Es buena idea invertir en infraestructura?", "Invertir en proyectos de construccion", "Oportunidades en infraestructura"],
        "responses": ["Invertir en infraestructura puede ofrecer retornos estables y contribuir al desarrollo economico, pero requiere entender los grandes ciclos economicos y politicos."]
      },
      {
        "tag": "proteger_inversiones_fraude",
        "patterns": ["¿Como protejo mis inversiones de fraudes?", "Evitar estafas en inversiones", "Seguridad para mis inversiones"],
        "responses": ["Protege tus inversiones verificando la credibilidad de asesores y plataformas de inversion, diversificando tus activos y manteniendote informado sobre tus inversiones."]
      },
      {
        "tag": "invertir_vehiculos_alternativos",
        "patterns": ["¿Que son los vehiculos de inversion alternativos?", "Invertir fuera de bolsa", "Opciones de inversion no tradicionales"],
        "responses": ["Los vehiculos de inversion alternativos incluyen bienes raices, arte, antigüedades y criptomonedas, ofreciendo diversificacion fuera de los mercados de acciones y bonos."]
      },
      {
        "tag": "ahorrar_sin_presupuesto",
        "patterns": ["¿Puedo ahorrar dinero sin un presupuesto estricto?", "Ahorrar de manera flexible", "Metodos de ahorro sin presupuesto"],
        "responses": ["Aunque un presupuesto ayuda, puedes ahorrar sin uno estableciendo transferencias automaticas a una cuenta de ahorros y reduciendo gastos innecesarios."]
      },
      {
        "tag": "cambiar_carreras_finanzas",
        "patterns": ["¿Como cambio de carrera sin afectar mis finanzas?", "Transicion de carrera y finanzas", "Manejo financiero al cambiar de empleo"],
        "responses": ["Al cambiar de carrera, ahorra un fondo de emergencia, reduce gastos, y busca formacion o certificaciones que aumenten tus oportunidades en el nuevo campo."]
      },
      {
        "tag": "comprar_seguros_salud",
        "patterns": ["¿Como elijo el mejor seguro de salud?", "Comparar planes de salud", "Seleccionar un seguro medico"],
        "responses": ["Elige un seguro de salud comparando coberturas, costos, red de proveedores y limites de gastos, considerando tus necesidades medicas y presupuesto."]
      },
      {
        "tag": "educacion_financiera_adultos",
        "patterns": ["¿Donde pueden los adultos aprender mas sobre finanzas?", "Educacion financiera para adultos", "Recursos de aprendizaje financiero para mayores"],
        "responses": ["Los adultos pueden aprender sobre finanzas en cursos en linea, talleres comunitarios, libros de finanzas y mediante asesoria financiera profesional."]
      },
      {
        "tag": "gestion_deudas_hipotecarias",
        "patterns": ["¿Como gestiono mejor mi deuda hipotecaria?", "Manejar deudas de la hipoteca", "Consejos para prestamos hipotecarios"],
        "responses": ["Gestiona tu deuda hipotecaria asegurando una tasa de interes competitiva, haciendo pagos adicionales cuando posible y refinanciando bajo condiciones favorables."]
      },
      {
        "tag": "seguros_desempleo",
        "patterns": ["¿Que es un seguro de desempleo?", "Beneficios del seguro contra desempleo", "Como funciona el seguro de desempleo"],
        "responses": ["El seguro de desempleo proporciona ingresos temporales a trabajadores desempleados que perdieron su trabajo sin culpa propia, ayudando a estabilizar sus finanzas."]
      },
      {
        "tag": "finanzas_freelancers",
        "patterns": ["¿Como manejan su dinero los freelancers?", "Finanzas para trabajadores independientes", "Consejos financieros para freelancers"],
        "responses": ["Los freelancers deben gestionar sus finanzas estableciendo un fondo de emergencia, pagando impuestos trimestrales y diversificando sus fuentes de ingresos."]
      },
      {
        "tag": "invertir_fondos_cerrados",
        "patterns": ["¿Que son los fondos de inversion cerrados?", "Invertir en fondos cerrados", "Caracteristicas de los fondos cerrados"],
        "responses": ["Los fondos de inversion cerrados tienen un numero fijo de acciones y suelen operar en mercados especificos o nichos, ofreciendo oportunidades y riesgos distintos a los fondos abiertos."]
      },
      {
        "tag": "prestamos_consolidacion",
        "patterns": ["¿Que son los prestamos de consolidacion de deudas?", "Beneficios de consolidar deudas", "Como funciona la consolidacion de prestamos"],
        "responses": ["Los prestamos de consolidacion de deudas permiten combinar multiples deudas en un solo prestamo con una tasa de interes mas baja, simplificando el pago mensual."]
      },
      {
        "tag": "optimizar_inversiones",
        "patterns": ["¿Como optimizo mis inversiones?", "Mejorar el rendimiento de inversiones", "Estrategias para optimizar portafolio"],
        "responses": ["Optimiza tus inversiones evaluando regularmente el rendimiento, rebalanceando tu portafolio para mantener tu estrategia de riesgo y diversificando tus activos."]
      },
      {
        "tag": "financiamiento_proyectos",
        "patterns": ["¿Como se financia un proyecto grande?", "Opciones de financiamiento para proyectos", "Conseguir fondos para proyectos importantes"],
        "responses": ["Financia proyectos grandes mediante prestamos, emision de bonos, crowdfunding o buscando inversores que esten interesados en el potencial de retorno del proyecto."]
      },
      {
        "tag": "reestructuracion_deudas",
        "patterns": ["¿Que es la reestructuracion de deudas?", "Como reestructurar mis deudas", "Alternativas para reestructurar deudas"],
        "responses": ["La reestructuracion de deudas implica negociar con acreedores para modificar los terminos de tus deudas, como reducir la tasa de interes o extender el periodo de pago."]
      },
      {
        "tag": "cambios_regulacion_financiera",
        "patterns": ["¿Como me afectan los cambios en la regulacion financiera?", "Impacto de nuevas leyes financieras", "Adaptarse a cambios regulatorios"],
        "responses": ["Los cambios en la regulacion financiera pueden afectar Como operas tus cuentas, tus estrategias de inversion y tus obligaciones fiscales. Es vital mantenerse informado y adaptarse a las nuevas normas."]
      },
      {
        "tag": "planificacion_financiera_familias",
        "patterns": ["¿Como hacen las familias para planificar sus finanzas?", "Planificacion financiera familiar", "Consejos para finanzas familiares"],
        "responses": ["Las familias pueden planificar sus finanzas estableciendo presupuestos, ahorrando para la educacion y la jubilacion, y asegurando adecuada proteccion financiera a traves de seguros."]
      },
      {
        "tag": "invertir_fondos_patrimoniales",
        "patterns": ["¿Que son los fondos patrimoniales?", "Invertir en un fondo patrimonial", "Caracteristicas de los fondos patrimoniales"],
        "responses": ["Los fondos patrimoniales son fondos de inversion que buscan preservar el capital y proporcionar un crecimiento constante. Son populares entre instituciones y individuos que buscan estabilidad."]
      },
      {
        "tag": "ahorrar_gastos_medicos",
        "patterns": ["¿Como puedo ahorrar en gastos medicos?", "Reducir costos de salud", "Consejos para economizar en medicina"],
        "responses": ["Para ahorrar en gastos medicos, utiliza seguros de salud, compara precios de tratamientos y medicamentos, y aprovecha cuentas de gastos flexibles o de ahorros de salud."]
      },
      {
        "tag": "seguros_vida",
        "patterns": ["¿Que debo considerar al elegir un seguro de vida?", "Tipos de seguros de vida", "Seleccionar el mejor seguro de vida"],
        "responses": ["Al elegir un seguro de vida, considera tu situacion financiera, las necesidades de tus dependientes, la cobertura ofrecida y las primas del seguro."]
      },
      {
        "tag": "educacion_financiera_jovenes",
        "patterns": ["¿Como enseño finanzas a los jovenes?", "Educacion financiera para adolescentes", "Inculcar habitos financieros en jovenes"],
        "responses": ["Enseña finanzas a los jovenes a traves de ejemplos practicos, como administrar una mesada, ahorrar para objetivos y comprender los conceptos basicos de ingresos y gastos."]
      },
      {
        "tag": "beneficios_fondos_cotizados",
        "patterns": ["¿Cuales son los beneficios de los fondos cotizados?", "Ventajas de invertir en ETFs", "Por que elegir fondos cotizados"],
        "responses": ["Los fondos cotizados (ETFs) ofrecen diversificacion, bajo costo, facilidad de compra y venta, y transparencia en sus holdings."]
      },
      {
        "tag": "gestionar_herencia",
        "patterns": ["¿Como gestiono una herencia?", "Manejo de bienes heredados", "Consejos para administrar una herencia"],
        "responses": ["Al gestionar una herencia, considera los impuestos aplicables, paga cualquier deuda del estamento, y planea Como invertir o usar los bienes heredados de manera prudente."]
      },
      {
        "tag": "riesgos_financieros_negocio",
        "patterns": ["¿Cuales son los riesgos financieros al iniciar un negocio?", "Identificar riesgos en nuevos negocios", "Precauciones financieras para emprendedores"],
        "responses": ["Los riesgos financieros al iniciar un negocio incluyen falta de fondos, fluctuaciones de ingresos, gastos inesperados y problemas de flujo de caja."]
      },
      {
        "tag": "invertir_tecnologia",
        "patterns": ["¿Es buena idea invertir en tecnologia?", "Invertir en sector tecnologico", "Riesgos y beneficios de la inversion tecnologica"],
        "responses": ["Invertir en tecnologia puede ofrecer altos retornos debido a la innovacion y crecimiento del sector, pero tambien conlleva riesgos de volatilidad y obsolescencia."]
      },
      {
        "tag": "plan_retiro_personalizado",
        "patterns": ["¿Como creo un plan de retiro personalizado?", "Planificacion individual para la jubilacion", "Construir un plan de retiro a medida"],
        "responses": ["Crea un plan de retiro personalizado evaluando tus necesidades futuras, estimando gastos, y eligiendo las opciones de inversion y ahorro que mejor se ajusten a tus objetivos y estilo de vida."]
      },
      {
        "tag": "invertir_sin_riesgo",
        "patterns": ["¿Existen inversiones sin riesgo?", "Opciones de inversion segura", "Invertir con garantia de capital"],
        "responses": ["No existen inversiones completamente sin riesgo, pero opciones como los bonos del Tesoro y cuentas de ahorro aseguradas ofrecen bajo riesgo a cambio de rendimientos mas moderados."]
      },
      {
        "tag": "creditos_refinanciamiento",
        "patterns": ["¿Que es el refinanciamiento de creditos?", "Como refinanciar mis deudas", "Beneficios del refinanciamiento"],
        "responses": ["El refinanciamiento de creditos implica reemplazar un prestamo existente por uno nuevo con mejores condiciones, como una tasa de interes mas baja, para reducir los pagos mensuales y mejorar el manejo de deudas."]
      },
      {
        "tag": "gestion_deudas_tarjetas",
        "patterns": ["¿Como gestiono la deuda de mis tarjetas de credito?", "Reducir deuda de tarjeta", "Consejos para manejar deuda de credito"],
        "responses": ["Para gestionar deudas de tarjetas de credito, intenta pagar mas que el minimo cada mes, negocia tasas de interes mas bajas y considera transferir saldos a tarjetas con 0% de interes de introduccion."]
      },
      {
        "tag": "ahorrar_compras_navidenas",
        "patterns": ["¿Como puedo ahorrar en compras navideñas?", "Presupuesto para festividades", "Economizar en gastos de Navidad"],
        "responses": ["Para ahorrar en compras navideñas, establece un presupuesto claro, compra con antelacion aprovechando ofertas y considera hacer regalos caseros o significativos en lugar de gastar mucho dinero."]
      },
      {
        "tag": "invertir_fondos_mixtos",
        "patterns": ["¿Que son los fondos mixtos y Como funcionan?", "Invertir en fondos balanceados", "Caracteristicas de los fondos mixtos"],
        "responses": ["Los fondos mixtos o balanceados invierten en una combinacion de acciones, bonos y otros activos. Estan diseñados para proporcionar un equilibrio entre riesgo y retorno, adecuados para inversores que buscan diversificacion."]
      },
      {
        "tag": "preparar_financieramente_crisis",
        "patterns": ["¿Como me preparo financieramente para una crisis?", "Finanzas en tiempos de crisis", "Reserva de emergencia"],
        "responses": ["Preparate financieramente para una crisis ahorrando en un fondo de emergencia, diversificando tus inversiones y manteniendo tus gastos bajo control para adaptarte a cambios economicos imprevistos."]
      },
      {
        "tag": "estrategias_ahorro_largo_plazo",
        "patterns": ["¿Cuales son las mejores estrategias de ahorro a largo plazo?", "Ahorrar a largo plazo", "Construir ahorros para el futuro"],
        "responses": ["Las mejores estrategias de ahorro a largo plazo incluyen maximizar contribuciones a cuentas de retiro, invertir en fondos indexados o ETFs, y revisar y ajustar tus inversiones periodicamente."]
      },{
        "tag": "seguros_cobertura_amplia",
        "patterns": ["¿Que es un seguro de cobertura amplia?", "Diferencias entre seguros de cobertura amplia y basica", "Beneficios del seguro de cobertura amplia"],
        "responses": ["El seguro de cobertura amplia ofrece proteccion mas extensa que la basica, cubriendo una variedad mas amplia de riesgos y a menudo incluyendo servicios adicionales."]
      },
      {
        "tag": "finanzas_responsables_empresa",
        "patterns": ["¿Como implemento finanzas responsables en mi empresa?", "Practicas de finanzas sostenibles para negocios", "Gestion financiera etica en empresas"],
        "responses": ["Implementa finanzas responsables en tu empresa adoptando practicas eticas, transparentes y sostenibles, considerando el impacto social y ambiental de tus decisiones financieras."]
      },
      
          {
            "tag": "empatia_perdida",
            "patterns": ["Estoy muy triste, perdi mucho dinero en una inversion"],
            "responses": ["Lamento mucho escuchar eso. Las perdidas pueden ser realmente desafiantes. ¿Hay algo en lo que pueda ayudarte a planificar tu proximo paso?"]
          },
          {
            "tag": "alegria_logro",
            "patterns": ["¡Acabo de pagar toda mi deuda!", "¡Acabo de pagar toda mi deuda!"],
            "responses": ["¡Eso es increible! Felicitaciones por alcanzar este gran hito financiero. ¿Tienes algun otro objetivo en mente ahora?"]
          },
          {
            "tag": "consuelo_preocupacion",
            "patterns": ["Estoy preocupado por no tener suficiente para la jubilacion"],
            "responses": ["Entiendo tus preocupaciones, y estas haciendo bien en pensar en ello ahora. Vamos a ver Como podemos mejorar tu plan de ahorro para la jubilacion."]
          },
          {
            "tag": "motivacion_desanimo",
            "patterns": ["No creo que pueda ahorrar suficiente dinero", "No tengo suficiente dinero para ahorrar"],
            "responses": ["No te desanimes, todos empezamos en algun lugar. Puedo ayudarte a revisar tu presupuesto y encontrar formas de ahorrar, sin importar cuan pequeñas sean."]
          },
          {
            "tag": "entusiasmo_meta_ahorro",
            "patterns": ["He alcanzado la mitad de mi meta de ahorro"],
            "responses": ["¡Eso es genial! Estas a mitad de camino, y cada paso cuenta. Sigue asi y pronto alcanzaras tu meta completa."]
          },
          {
            "tag": "apoyo_decision",
            "patterns": ["¿Deberia invertir en este momento?", "¿Deberia invertir en este hoy en dia?"],
            "responses": ["Es importante que te sientas seguro con tus decisiones de inversion. Podemos revisar tus opciones y considerar tus objetivos financieros para tomar la mejor decision."]
          },
          {
            "tag": "celebracion_logro_financiero",
            "patterns": ["Finalmente ahorre suficiente para mi fondo de emergencia"],
            "responses": ["¡Felicitaciones! Has logrado un importante pilar de seguridad financiera. ¿Estas pensando en establecer una nueva meta de ahorro ahora?"]
          },
          {
            "tag": "solidaridad_error",
            "patterns": ["Creo que cometi un error con mi presupuesto este mes"],
            "responses": ["Todos cometemos errores, lo importante es aprender de ellos. Vamos a revisar tu presupuesto juntos y ajustar lo que sea necesario."]
          },
          {
            "tag": "aliento_nuevo_proyecto",
            "patterns": ["Estoy pensando en iniciar un negocio", "Estoy pensando en convertime en un emprendedor", "Estoy pensando un nuevo emprendimiento"],
            "responses": ["¡Esa es una iniciativa emocionante! Estoy aqui para ayudarte a planificar y asegurarme de que tienes una base financiera solida para comenzar."]
          },
          {
            "tag": "simpatia_frustracion",
            "patterns": ["Me frustra no entender estos terminos financieros"],
            "responses": ["Puede ser complicado, pero estas haciendo un gran esfuerzo por aprender. ¿Te gustaria que explique algunos terminos en particular?"]
          },
          
              {
                "tag": "confusion_general",
                "patterns": ["No entiendo lo que dices"],
                "responses": ["Parece que no fui claro. Permiteme intentarlo de nuevo o explicarlo de otra manera."]
              },
              {
                "tag": "sin_datos",
                "patterns": ["¿Que datos tienes sobre las tendencias del mercado futuro?"],
                "responses": ["Actualmente no tengo informacion sobre futuras tendencias del mercado. ¿Puedo ayudarte con algo mas especifico o actual?"]
              },
              {
                "tag": "sin_informacion_especifica",
                "patterns": ["Dime mas sobre esta inversion especifica que no encuentro"],
                "responses": ["No tengo detalles sobre esa inversion especifica. ¿Quieres saber mas sobre tipos similares de inversiones?"]
              },
              {
                "tag": "confusion_detalle",
                "patterns": ["No comprendo los detalles que me diste"],
                "responses": ["Lo siento si los detalles no fueron claros. Vamos a desglosarlos mejor."]
              },
              {
                "tag": "solicitud_incomprensible",
                "patterns": ["asdfghjkl"],
                "responses": ["No pude entender lo que necesitas. ¿Puedes reformular tu pregunta?"]
              },
              {
                "tag": "sin_acceso_datos",
                "patterns": ["¿Puedes darme el ultimo precio de la accion XYZ?"],
                "responses": ["Lo siento, no tengo acceso en tiempo real a datos del mercado de valores. Te recomiendo verificar una fuente confiable como un sitio de noticias financieras."]
              },
              {
                "tag": "respuesta_indefinida",
                "patterns": ["Cuentame sobre un tema que no conoces"],
                "responses": ["No tengo informacion sobre ese tema. Siempre estoy aprendiendo, pero algunas areas estan fuera de mi alcance actual."]
              },
              {
                "tag": "error_desconocido",
                "patterns": ["Esto no tiene sentido"],
                "responses": ["Parece que algo no salio bien. Vamos a intentarlo de nuevo."]
              },
              {
                "tag": "solicitud_vaga",
                "patterns": ["Hablame de finanzas"],
                "responses": ["Las finanzas son un tema amplio. ¿Podrias especificar un poco mas sobre que aspecto de las finanzas te interesa?"]
              },
              {
                "tag": "sin_respuesta",
                "patterns": ["¿Que opinas sobre la politica economica de Marte?"],
                "responses": ["Eso esta fuera de mi conocimiento actual. ¿Hay algo mas terrenal en lo que pueda asistirte?"]
              },
              {
                "tag": "ambiguedad",
                "patterns": ["¿Que debo hacer con mi dinero?"],
                "responses": ["Esa es una pregunta muy amplia. Podriamos comenzar revisando tus metas financieras y tu situacion actual."]
              },
              {
                "tag": "sin_informacion_actualizada",
                "patterns": ["Dame las ultimas noticias sobre la economia"],
                "responses": ["No tengo acceso directo a las noticias mas recientes. Te recomiendo consultar un sitio web de noticias confiable para obtener la informacion mas actual."]
              },
              {
                "tag": "peticion_irrealizable",
                "patterns": ["Quiero que inviertas mi dinero ahora mismo"],
                "responses": ["No puedo realizar inversiones directamente. Sin embargo, puedo ofrecerte consejos sobre Como y donde podrias invertir."]
              },
              {
                "tag": "sin_comprender",
                "patterns": ["No entiendo lo que acabo de leer"],
                "responses": ["Vamos a revisarlo juntos. Dime que parte no fue clara y te ayudare a entenderla mejor."]
              },
              {
                "tag": "sin_capacidad_respuesta",
                "patterns": ["¿Puedes predecir el futuro de la economia?"],
                "responses": ["No puedo predecir el futuro, pero puedo ofrecer analisis basados en datos e informacion historica. ¿Te interesa alguna tendencia en particular?"]
              },
              {
                "tag": "fuera_de_alcance",
                "patterns": ["Dime si debo comprar esta casa"],
                "responses": ["Decidir comprar una casa es una decision significativa y personal. Deberias considerar hablar con un asesor financiero o un agente inmobiliario para discutir todos los factores involucrados."]
              },
              {
                "tag": "respuesta_insuficiente",
                "patterns": ["Tu respuesta no me ayuda"],
                "responses": ["Lamento escuchar eso. Vamos a intentar abordarlo de otra manera. ¿Que mas necesitas saber?"]
              },
              {
                "tag": "solicitud_no_reconocida",
                "patterns": ["zkxjcv"],
                "responses": ["Parece que hubo un error en la entrada. ¿Puedes repetir o clarificar tu pregunta?"]
              },
              {
                "tag": "respuesta_inapropiada",
                "patterns": ["Eso no es lo que pregunte"],
                "responses": ["Mis disculpas por eso. Intentemos de nuevo. ¿Puedes repetir o especificar mas tu pregunta?"]
              },
              {
                "tag": "sin_conocimiento_especifico",
                "patterns": ["Cuentame sobre la historia del dinero en Antartida"],
                "responses": ["No tengo informacion especifica sobre la historia del dinero en Antartida. ¿Hay otra area geografica o tema que te interese?"]
              },{
                "tag": "Acciones",
                "patterns": ["¿Qué son las acciones?"],
                "responses": ["Las acciones son títulos valores que representan una parte proporcional del capital social de una empresa."]
              },{
                "tag": "Bonos",
                "patterns": ["¿Qué son los bonos?"],
                "responses": ["Los bonos son instrumentos de deuda emitidos por entidades para financiarse, que pagan intereses periódicos y devuelven el principal al vencimiento."]
              },
              {
                "tag": "Cartera de inversión",
                "patterns": ["¿Qué es una cartera de inversión?"],
                "responses": ["Una cartera de inversión es un conjunto de activos financieros diversificados que posee un inversor."]
              },
              {
                "tag": "Diversificación",
                "patterns": ["¿Qué es la diversificación?"],
                "responses": ["La diversificación es una estrategia de inversión que reduce el riesgo distribuyendo las inversiones entre distintos activos."]
              },
              {
                "tag": "Apalancamiento",
                "patterns": ["¿Qué es el apalancamiento?"],
                "responses": ["El apalancamiento es el uso de deuda para aumentar el potencial de retorno de una inversión."]
              },
              {
                "tag": "Amortización",
                "patterns": ["¿Qué es la amortización?"],
                "responses": ["La amortización es el proceso de reducir una deuda mediante pagos periódicos hasta su eliminación."]
              },
              {
                "tag": "Valor presente neto",
                "patterns": ["¿Qué es el valor presente neto?"],
                "responses": ["El valor presente neto es una medida de la rentabilidad de una inversión, calculada como el valor actual de los flujos de caja netos."]
              },
              {
                "tag": "Tasa interna de retorno",
                "patterns": ["¿Qué es la tasa interna de retorno?"],
                "responses": ["La tasa interna de retorno es la tasa de descuento que iguala el valor presente neto de una inversión a cero."]
              },
              {
                "tag": "Mercado de capitales",
                "patterns": ["¿Qué es el mercado de capitales?"],
                "responses": ["El mercado de capitales es donde se negocian instrumentos financieros de largo plazo, como acciones y bonos."]
              },{
                "tag": "Mercado de dinero",
                "patterns": ["¿Qué es el mercado de dinero?"],
                "responses": ["El mercado de dinero es donde se negocian instrumentos financieros a corto plazo, como letras del Tesoro y certificados de depósito."]
              },
              {
                "tag": "Depreciación",
                "patterns": ["¿Qué es la depreciación?"],
                "responses": ["La depreciación es la reducción del valor de un activo a lo largo del tiempo debido al desgaste y la obsolescencia."]
              },
              {
                "tag": "Crédito",
                "patterns": ["¿Qué es el crédito?"],
                "responses": ["El crédito es la capacidad de un individuo o empresa para obtener bienes o servicios antes de pagar por ellos."]
              },
              {
                "tag": "Débito",
                "patterns": ["¿Qué es el débito?"],
                "responses": ["El débito es un cargo que se realiza a una cuenta, reduciendo su saldo."]
              },
              {
                "tag": "Tasa de interés",
                "patterns": ["¿Qué es la tasa de interés?"],
                "responses": ["La tasa de interés es el porcentaje que se cobra por el uso del dinero prestado o invertido."]
              },
              {
                "tag": "Arbitraje",
                "patterns": ["¿Qué es el arbitraje?"],
                "responses": ["El arbitraje es la compra y venta simultánea de un activo en diferentes mercados para aprovechar diferencias de precios."]
              },
              {
                "tag": "Cobertura",
                "patterns": ["¿Qué es la cobertura?"],
                "responses": ["La cobertura es una estrategia para reducir el riesgo financiero mediante el uso de instrumentos derivados."]
              },
              {
                "tag": "Riesgo sistemático",
                "patterns": ["¿Qué es el riesgo sistemático?"],
                "responses": ["El riesgo sistemático es el riesgo inherente a todo el mercado o sector, no diversificable."]
              },
              {
                "tag": "Riesgo no sistemático",
                "patterns": ["¿Qué es el riesgo no sistemático?"],
                "responses": ["El riesgo no sistemático es el riesgo específico de una empresa o industria, diversificable."]
              },
              {
                "tag": "Índice bursátil",
                "patterns": ["¿Qué es un índice bursátil?"],
                "responses": ["Un índice bursátil es una medida del rendimiento de un conjunto de acciones que representan un mercado o sector."]
              },
              {
                "tag": "Fondos de cobertura",
                "patterns": ["¿Qué son los fondos de cobertura?"],
                "responses": ["Los fondos de cobertura son fondos de inversión que emplean estrategias avanzadas para obtener rendimientos elevados."]
              },
              {
                "tag": "Opciones financieras",
                "patterns": ["¿Qué son las opciones financieras?"],
                "responses": ["Las opciones financieras son contratos que otorgan el derecho, pero no la obligación, de comprar o vender un activo a un precio específico."]
              },
              {
                "tag": "Futuros financieros",
                "patterns": ["¿Qué son los futuros financieros?"],
                "responses": ["Los futuros financieros son contratos que obligan a comprar o vender un activo a un precio específico en una fecha futura."]
              },
              {
                "tag": "Venta en corto",
                "patterns": ["¿Qué es la venta en corto?"],
                "responses": ["La venta en corto es una estrategia de inversión que busca beneficiarse de la caída en el precio de un activo."]
              },
              {
                "tag": "Compra apalancada",
                "patterns": ["¿Qué es la compra apalancada?"],
                "responses": ["La compra apalancada es la adquisición de una empresa utilizando una cantidad significativa de deuda."]
              },
              {
                "tag": "Capital de trabajo",
                "patterns": ["¿Qué es el capital de trabajo?"],
                "responses": ["El capital de trabajo es la diferencia entre los activos corrientes y los pasivos corrientes de una empresa."]
              },
              {
                "tag": "Ciclo económico",
                "patterns": ["¿Qué es el ciclo económico?"],
                "responses": ["El ciclo económico es el patrón de expansión y contracción de la economía a lo largo del tiempo."]
              },
              {
                "tag": "Deflación",
                "patterns": ["¿Qué es la deflación?"],
                "responses": ["La deflación es la disminución general de los precios de bienes y servicios en una economía."]
              },
              {
                "tag": "Banca de inversión",
                "patterns": ["¿Qué es la banca de inversión?"],
                "responses": ["La banca de inversión ofrece servicios de asesoría financiera y financiamiento a empresas y gobiernos."]
              },
              {
                "tag": "Auditoría",
                "patterns": ["¿Qué es la auditoría?"],
                "responses": ["La auditoría es la revisión y verificación de los estados financieros de una empresa."]
              },
              {
                "tag": "Activos intangibles",
                "patterns": ["¿Qué son los activos intangibles?"],
                "responses": ["Los activos intangibles son activos no físicos como patentes, marcas y derechos de autor."]
              },
              {
                "tag": "Pasivos contingentes",
                "patterns": ["¿Qué son los pasivos contingentes?"],
                "responses": ["Los pasivos contingentes son posibles obligaciones que dependen de eventos futuros inciertos."]
              },
              {
                "tag": "Rendimiento sobre la inversión",
                "patterns": ["¿Qué es el rendimiento sobre la inversión?"],
                "responses": ["El rendimiento sobre la inversión mide la ganancia o pérdida generada en relación con la inversión inicial."]
              },
              {
                "tag": "Margen de beneficio",
                "patterns": ["¿Qué es el margen de beneficio?"],
                "responses": ["El margen de beneficio es el porcentaje de ingresos que una empresa retiene como ganancia neta después de los costos."]
              },
              {
                "tag": "Punto de equilibrio",
                "patterns": ["¿Qué es el punto de equilibrio?"],
                "responses": ["El punto de equilibrio es el nivel de ventas en el cual los ingresos igualan los costos, sin generar ganancias ni pérdidas."]
              },
              {
                "tag": "Estado de flujo de efectivo",
                "patterns": ["¿Qué es el estado de flujo de efectivo?"],
                "responses": ["El estado de flujo de efectivo es un informe financiero que muestra las entradas y salidas de efectivo de una empresa."]
              },
              {
                "tag": "Financiamiento a corto plazo",
                "patterns": ["¿Qué es el financiamiento a corto plazo?"],
                "responses": ["El financiamiento a corto plazo se refiere a préstamos o créditos que deben ser pagados en menos de un año."]
              },
              {
                "tag": "Financiamiento a largo plazo",
                "patterns": ["¿Qué es el financiamiento a largo plazo?"],
                "responses": ["El financiamiento a largo plazo se refiere a préstamos o créditos con un plazo de pago superior a un año."]
              },
              {
                "tag": "Coste de oportunidad",
                "patterns": ["¿Qué es el coste de oportunidad?"],
                "responses": ["El coste de oportunidad es el valor de la mejor alternativa no elegida al tomar una decisión."]
              },
              {
                "tag": "Valor de mercado",
                "patterns": ["¿Qué es el valor de mercado?"],
                "responses": ["El valor de mercado es el precio al que un activo se puede comprar o vender en un mercado abierto."]
              },
              {
                "tag": "Valor contable",
                "patterns": ["¿Qué es el valor contable?"],
                "responses": ["El valor contable es el valor de un activo según los registros contables de una empresa."]
              },
              {
                "tag": "Valor intrínseco",
                "patterns": ["¿Qué es el valor intrínseco?"],
                "responses": ["El valor intrínseco es el valor real de un activo basado en análisis fundamentales, sin considerar el precio de mercado."]
              },
              {
                "tag": "Ratio de solvencia",
                "patterns": ["¿Qué es el ratio de solvencia?"],
                "responses": ["El ratio de solvencia mide la capacidad de una empresa para cumplir con sus obligaciones a largo plazo."]
              },
              {
                "tag": "Ratio de liquidez",
                "patterns": ["¿Qué es el ratio de liquidez?"],
                "responses": ["El ratio de liquidez mide la capacidad de una empresa para cumplir con sus obligaciones a corto plazo."]
              },
              {
                "tag": "Ratio de endeudamiento",
                "patterns": ["¿Qué es el ratio de endeudamiento?"],
                "responses": ["El ratio de endeudamiento mide el nivel de deuda de una empresa en relación con su capital."]
              },
              {
                "tag": "Análisis de sensibilidad",
                "patterns": ["¿Qué es el análisis de sensibilidad?"],
                "responses": ["El análisis de sensibilidad evalúa cómo diferentes variables afectan el resultado de un modelo financiero."]
              },
              {
                "tag": "Presupuesto de capital",
                "patterns": ["¿Qué es el presupuesto de capital?"],
                "responses": ["El presupuesto de capital es el proceso de planificación y gestión de inversiones a largo plazo de una empresa."]
              },
              {
                "tag": "Costos fijos",
                "patterns": ["¿Qué son los costos fijos?"],
                "responses": ["Los costos fijos son costos que no cambian con el nivel de producción o ventas."]
              },
              {
                "tag": "Costos variables",
                "patterns": ["¿Qué son los costos variables?"],
                "responses": ["Los costos variables cambian en función del nivel de producción o ventas."]
              },{
                "tag": "Contabilidad de gestión",
                "patterns": ["¿Qué es la contabilidad de gestión?"],
                "responses": ["La contabilidad de gestión se centra en proporcionar información para la toma de decisiones internas de una empresa."]
              },
              {
                "tag": "Contabilidad de costos",
                "patterns": ["¿Qué es la contabilidad de costos?"],
                "responses": ["La contabilidad de costos analiza y registra todos los costos asociados con la producción de bienes o servicios."]
              },
              {
                "tag": "Contabilidad financiera",
                "patterns": ["¿Qué es la contabilidad financiera?"],
                "responses": ["La contabilidad financiera se ocupa de la preparación de estados financieros para uso externo."]
              },
              {
                "tag": "Contabilidad tributaria",
                "patterns": ["¿Qué es la contabilidad tributaria?"],
                "responses": ["La contabilidad tributaria se enfoca en la preparación de declaraciones fiscales y el cumplimiento de las leyes tributarias."]
              },
              {
                "tag": "Plan de negocios",
                "patterns": ["¿Qué es un plan de negocios?"],
                "responses": ["Un plan de negocios es un documento que describe los objetivos, estrategias y previsiones financieras de una empresa."]
              },
              {
                "tag": "Estrategia de salida",
                "patterns": ["¿Qué es una estrategia de salida?"],
                "responses": ["Una estrategia de salida es un plan para vender una inversión o empresa a fin de obtener ganancias."]
              },
              {
                "tag": "Oferta pública inicial",
                "patterns": ["¿Qué es una oferta pública inicial?"],
                "responses": ["Una oferta pública inicial es el proceso mediante el cual una empresa privada se convierte en pública vendiendo acciones en la bolsa."]
              },
              {
                "tag": "Capital riesgo",
                "patterns": ["¿Qué es el capital riesgo?"],
                "responses": ["El capital riesgo es financiamiento proporcionado a empresas emergentes con alto potencial de crecimiento a cambio de participación accionaria."]
              },
              {
                "tag": "Capital privado",
                "patterns": ["¿Qué es el capital privado?"],
                "responses": ["El capital privado es financiamiento de inversionistas a empresas no cotizadas en bolsa, a menudo para reestructuración o expansión."]
              },
              {
                "tag": "Análisis técnico",
                "patterns": ["¿Qué es el análisis técnico?"],
                "responses": ["El análisis técnico es una metodología para evaluar inversiones mediante el análisis de estadísticas generadas por la actividad del mercado."]
              },
              {
                "tag": "Análisis fundamental",
                "patterns": ["¿Qué es el análisis fundamental?"],
                "responses": ["El análisis fundamental evalúa el valor de una inversión analizando factores económicos, financieros y otros cualitativos y cuantitativos."]
              },
              {
                "tag": "Indicadores económicos",
                "patterns": ["¿Qué son los indicadores económicos?"],
                "responses": ["Los indicadores económicos son estadísticas que muestran el desempeño económico de un país, como el PIB, la inflación y el desempleo."]
              },
              {
                "tag": "Política monetaria",
                "patterns": ["¿Qué es la política monetaria?"],
                "responses": ["La política monetaria es la gestión de la oferta de dinero y las tasas de interés por parte de un banco central para influir en la economía."]
              },
              {
                "tag": "Política fiscal",
                "patterns": ["¿Qué es la política fiscal?"],
                "responses": ["La política fiscal es el uso de gasto público y recaudación de impuestos por parte del gobierno para influir en la economía."]
              },{
                "tag": "Gestión de riesgos",
                "patterns": ["¿Qué es la gestión de riesgos?"],
                "responses": ["La gestión de riesgos es el proceso de identificar, evaluar y mitigar los riesgos financieros en una empresa."]
              },
              {
                "tag": "Planificación patrimonial",
                "patterns": ["¿Qué es la planificación patrimonial?"],
                "responses": ["La planificación patrimonial es el proceso de organizar y distribuir los activos de una persona para maximizar su valor y minimizar impuestos."]
              },
              {
                "tag": "Fideicomiso",
                "patterns": ["¿Qué es un fideicomiso?"],
                "responses": ["Un fideicomiso es un acuerdo legal en el cual una persona o entidad administra activos en beneficio de otra."]
              },
              {
                "tag": "Heredero",
                "patterns": ["¿Qué es un heredero?"],
                "responses": ["Un heredero es una persona que recibe los bienes de una persona fallecida según su testamento o las leyes de sucesión."]
              },
              {
                "tag": "Testamento",
                "patterns": ["¿Qué es un testamento?"],
                "responses": ["Un testamento es un documento legal en el que una persona expresa cómo quiere que se distribuyan sus bienes después de su muerte."]
              },
              {
                "tag": "Capitalización bursátil",
                "patterns": ["¿Qué es la capitalización bursátil?"],
                "responses": ["La capitalización bursátil es el valor total de mercado de todas las acciones en circulación de una empresa."]
              },
              {
                "tag": "Dividendos",
                "patterns": ["¿Qué son los dividendos?"],
                "responses": ["Los dividendos son distribuciones de las ganancias de una empresa a sus accionistas."]
              },
              {
                "tag": "Ingreso pasivo",
                "patterns": ["¿Qué es el ingreso pasivo?"],
                "responses": ["El ingreso pasivo es el dinero ganado con poco o ningún esfuerzo continuo, como alquileres o inversiones."]
              },
              {
                "tag": "Ingreso residual",
                "patterns": ["¿Qué es el ingreso residual?"],
                "responses": ["El ingreso residual es el dinero que una persona sigue ganando después de haber terminado el trabajo inicial, como regalías."]
              },
              {
                "tag": "Escrow",
                "patterns": ["¿Qué es escrow?"],
                "responses": ["Escrow es un acuerdo donde un tercero mantiene y regula el pago de fondos requeridos para dos partes involucradas en una transacción."]
              },
              {
                "tag": "Deducción fiscal",
                "patterns": ["¿Qué es una deducción fiscal?"],
                "responses": ["Una deducción fiscal es un gasto que se puede restar de los ingresos brutos para reducir la cantidad de ingresos sujetos a impuestos."]
              },
              {
                "tag": "Evasión fiscal",
                "patterns": ["¿Qué es la evasión fiscal?"],
                "responses": ["La evasión fiscal es el acto ilegal de no pagar los impuestos debidos."]
              },
              {
                "tag": "Elusión fiscal",
                "patterns": ["¿Qué es la elusión fiscal?"],
                "responses": ["La elusión fiscal es el uso de métodos legales para minimizar el pago de impuestos."]
              },
              {
                "tag": "Renta variable",
                "patterns": ["¿Qué es la renta variable?"],
                "responses": ["La renta variable se refiere a las inversiones en acciones, cuyo rendimiento no está garantizado."]
              },
              {
                "tag": "Renta fija",
                "patterns": ["¿Qué es la renta fija?"],
                "responses": ["La renta fija se refiere a las inversiones que ofrecen retornos periódicos y predecibles, como los bonos."]
              },
              {
                "tag": "Liquidez del mercado",
                "patterns": ["¿Qué es la liquidez del mercado?"],
                "responses": ["La liquidez del mercado es la capacidad de comprar o vender activos rápidamente sin afectar significativamente su precio."]
              },
              {
                "tag": "Cotización bursátil",
                "patterns": ["¿Qué es la cotización bursátil?"],
                "responses": ["La cotización bursátil es el precio al cual se negocian las acciones de una empresa en el mercado de valores."]
              },{
                "tag": "Índice de precios al consumidor",
                "patterns": ["¿Qué es el índice de precios al consumidor?"],
                "responses": ["El índice de precios al consumidor mide la variación de los precios de una canasta de bienes y servicios representativa del consumo familiar."]
              },
              {
                "tag": "Índice de precios al productor",
                "patterns": ["¿Qué es el índice de precios al productor?"],
                "responses": ["El índice de precios al productor mide la variación de los precios que reciben los productores por sus bienes y servicios."]
              },
              {
                "tag": "Tasa de desempleo",
                "patterns": ["¿Qué es la tasa de desempleo?"],
                "responses": ["La tasa de desempleo es el porcentaje de la población activa que se encuentra en busca de trabajo y no lo encuentra."]
              },
              {
                "tag": "Producto Interno Bruto",
                "patterns": ["¿Qué es el Producto Interno Bruto?"],
                "responses": ["El Producto Interno Bruto es el valor total de los bienes y servicios producidos en un país durante un periodo determinado."]
              },
              {
                "tag": "Déficit presupuestario",
                "patterns": ["¿Qué es el déficit presupuestario?"],
                "responses": ["El déficit presupuestario ocurre cuando los gastos del gobierno superan sus ingresos en un periodo determinado."]
              },
              {
                "tag": "Superávit presupuestario",
                "patterns": ["¿Qué es el superávit presupuestario?"],
                "responses": ["El superávit presupuestario ocurre cuando los ingresos del gobierno superan sus gastos en un periodo determinado."]
              },
              {
                "tag": "Cuentas por cobrar",
                "patterns": ["¿Qué son las cuentas por cobrar?"],
                "responses": ["Las cuentas por cobrar son derechos de cobro que tiene una empresa por la venta de bienes o servicios a crédito."]
              },
              {
                "tag": "Cuentas por pagar",
                "patterns": ["¿Qué son las cuentas por pagar?"],
                "responses": ["Las cuentas por pagar son obligaciones de pago que tiene una empresa por la compra de bienes o servicios a crédito."]
              },
              {
                "tag": "Capital social",
                "patterns": ["¿Qué es el capital social?"],
                "responses": ["El capital social es el valor total de las aportaciones de los socios o accionistas de una empresa."]
              },
              {
                "tag": "Autofinanciamiento",
                "patterns": ["¿Qué es el autofinanciamiento?"],
                "responses": ["El autofinanciamiento es la capacidad de una empresa para financiar sus operaciones y proyectos con sus propias ganancias."]
              },
              {
                "tag": "Desinversión",
                "patterns": ["¿Qué es la desinversión?"],
                "responses": ["La desinversión es la venta de activos o negocios por parte de una empresa para obtener liquidez o reorientar su estrategia."]
              },
              {
                "tag": "Ganancias retenidas",
                "patterns": ["¿Qué son las ganancias retenidas?"],
                "responses": ["Las ganancias retenidas son los beneficios no distribuidos a los accionistas y reinvertidos en la empresa."]
              },
              {
                "tag": "Contabilidad por partida doble",
                "patterns": ["¿Qué es la contabilidad por partida doble?"],
                "responses": ["La contabilidad por partida doble es un sistema que registra cada transacción en dos cuentas, una de débito y otra de crédito."]
              },
              {
                "tag": "Control interno",
                "patterns": ["¿Qué es el control interno?"],
                "responses": ["El control interno es un conjunto de procedimientos y políticas para salvaguardar los activos de una empresa y asegurar la exactitud de su información financiera."]
              },
              {
                "tag": "Fraude financiero",
                "patterns": ["¿Qué es el fraude financiero?"],
                "responses": ["El fraude financiero es la manipulación o falsificación de información financiera para obtener beneficios ilegales."]
              },
              {
                "tag": "Compliance",
                "patterns": ["¿Qué es compliance?"],
                "responses": ["Compliance se refiere al cumplimiento de leyes, normas y políticas internas por parte de una empresa."]
              },
              {
                "tag": "Normas internacionales de contabilidad",
                "patterns": ["¿Qué son las Normas Internacionales de Contabilidad?"],
                "responses": ["Las Normas Internacionales de Contabilidad son estándares para la preparación de estados financieros, garantizando transparencia y comparabilidad."]
              },
              {
                "tag": "Normas internacionales de información financiera",
                "patterns": ["¿Qué son las Normas Internacionales de Información Financiera?"],
                "responses": ["Las Normas Internacionales de Información Financiera son un conjunto de normas contables globales para la elaboración de informes financieros."]
              },
              {
                "tag": "Contabilidad creativa",
                "patterns": ["¿Qué es la contabilidad creativa?"],
                "responses": ["La contabilidad creativa implica el uso de técnicas contables para presentar los estados financieros de una manera más favorable."]
              },
              {
                "tag": "Valoración de empresas",
                "patterns": ["¿Qué es la valoración de empresas?"],
                "responses": ["La valoración de empresas es el proceso de determinar el valor económico de una empresa o unidad de negocio."]
              },
              {
                "tag": "Alianzas estratégicas",
                "patterns": ["¿Qué son las alianzas estratégicas?"],
                "responses": ["Las alianzas estratégicas son acuerdos entre empresas para colaborar en proyectos específicos o compartir recursos."]
              },
              {
                "tag": "Fusiones y adquisiciones",
                "patterns": ["¿Qué son las fusiones y adquisiciones?"],
                "responses": ["Las fusiones y adquisiciones son procesos donde dos empresas se combinan o una compra a otra para fortalecer su posición en el mercado."]
              },
              {
                "tag": "Debida diligencia",
                "patterns": ["¿Qué es la debida diligencia?"],
                "responses": ["La debida diligencia es la investigación y evaluación de una empresa antes de una transacción comercial importante."]
              },
              {
                "tag": "Informe anual",
                "patterns": ["¿Qué es un informe anual?"],
                "responses": ["Un informe anual es un documento que proporciona una visión general del desempeño financiero y operativo de una empresa durante el año."]
              },{
                "tag": "Ratios de rentabilidad",
                "patterns": ["¿Qué son los ratios de rentabilidad?"],
                "responses": ["Los ratios de rentabilidad miden la capacidad de una empresa para generar ganancias en relación con sus ingresos, activos o patrimonio."]
              },
              {
                "tag": "Ratios de eficiencia",
                "patterns": ["¿Qué son los ratios de eficiencia?"],
                "responses": ["Los ratios de eficiencia evalúan cómo una empresa utiliza sus recursos para generar ingresos y maximizar beneficios."]
              },
              {
                "tag": "Ratios de endeudamiento",
                "patterns": ["¿Qué son los ratios de endeudamiento?"],
                "responses": ["Los ratios de endeudamiento indican el nivel de deuda de una empresa en relación con su capital propio o activos totales."]
              },
              {
                "tag": "Ratios de mercado",
                "patterns": ["¿Qué son los ratios de mercado?"],
                "responses": ["Los ratios de mercado evalúan el valor de mercado de una empresa en relación con su rendimiento financiero, como el PER."]
              },
              {
                "tag": "Capital circulante",
                "patterns": ["¿Qué es el capital circulante?"],
                "responses": ["El capital circulante es la diferencia entre los activos corrientes y los pasivos corrientes de una empresa."]
              },
              {
                "tag": "Préstamos sindicados",
                "patterns": ["¿Qué son los préstamos sindicados?"],
                "responses": ["Los préstamos sindicados son préstamos ofrecidos por un grupo de bancos a un solo prestatario."]
              },
              {
                "tag": "Microfinanzas",
                "patterns": ["¿Qué son las microfinanzas?"],
                "responses": ["Las microfinanzas ofrecen servicios financieros a personas de bajos ingresos o pequeñas empresas que no tienen acceso a la banca tradicional."]
              },
              {
                "tag": "Banca móvil",
                "patterns": ["¿Qué es la banca móvil?"],
                "responses": ["La banca móvil permite realizar operaciones bancarias a través de dispositivos móviles, como teléfonos inteligentes."]
              },
              {
                "tag": "Criptomonedas",
                "patterns": ["¿Qué son las criptomonedas?"],
                "responses": ["Las criptomonedas son monedas digitales que utilizan la criptografía para asegurar y verificar transacciones."]
              },
              {
                "tag": "Blockchain",
                "patterns": ["¿Qué es blockchain?"],
                "responses": ["Blockchain es una tecnología de registro distribuido que asegura y verifica transacciones mediante criptografía."]
              },
              {
                "tag": "Fintech",
                "patterns": ["¿Qué es fintech?"],
                "responses": ["Fintech se refiere a las tecnologías financieras que buscan mejorar y automatizar los servicios y procesos financieros."]
              },
              {
                "tag": "Economía colaborativa",
                "patterns": ["¿Qué es la economía colaborativa?"],
                "responses": ["La economía colaborativa se basa en compartir y utilizar recursos y servicios entre individuos, a menudo a través de plataformas digitales."]
              },
              {
                "tag": "Crowdfunding",
                "patterns": ["¿Qué es el crowdfunding?"],
                "responses": ["El crowdfunding es un método de financiamiento donde se recauda dinero para proyectos o negocios a través de pequeñas contribuciones de muchas personas."]
              },
              {
                "tag": "Peer-to-peer lending",
                "patterns": ["¿Qué es el peer-to-peer lending?"],
                "responses": ["El peer-to-peer lending es un sistema de préstamos donde los individuos prestan dinero directamente a otros sin intermediarios tradicionales."]
              },
              {
                "tag": "Seguros",
                "patterns": ["¿Qué son los seguros?"],
                "responses": ["Los seguros son contratos que transfieren el riesgo de pérdida financiera de una persona o empresa a una aseguradora a cambio de una prima."]
              },
              {
                "tag": "Reaseguro",
                "patterns": ["¿Qué es el reaseguro?"],
                "responses": ["El reaseguro es un acuerdo en el que una aseguradora transfiere parte de sus riesgos a otra aseguradora para reducir su exposición a grandes pérdidas."]
              },
              {
                "tag": "Análisis crediticio",
                "patterns": ["¿Qué es el análisis crediticio?"],
                "responses": ["El análisis crediticio evalúa la capacidad de un prestatario para cumplir con sus obligaciones de deuda."]
              },
              {
                "tag": "Perfil de riesgo",
                "patterns": ["¿Qué es el perfil de riesgo?"],
                "responses": ["El perfil de riesgo describe la disposición y capacidad de una persona o entidad para asumir riesgos financieros."]
              },
              {
                "tag": "Puntuación de crédito",
                "patterns": ["¿Qué es la puntuación de crédito?"],
                "responses": ["La puntuación de crédito es una medida numérica de la solvencia crediticia de una persona, basada en su historial crediticio."]
              },
              {
                "tag": "Escala salarial",
                "patterns": ["¿Qué es una escala salarial?"],
                "responses": ["Una escala salarial es una tabla que muestra los salarios correspondientes a diferentes niveles de experiencia y responsabilidad en una organización."]
              },
              {
                "tag": "Hedge funds",
                "patterns": ["¿Qué son los hedge funds?"],
                "responses": ["Los hedge funds son fondos de inversión que emplean estrategias avanzadas para obtener altos rendimientos, a menudo con mayor riesgo."]
              },
              {
                "tag": "Private equity",
                "patterns": ["¿Qué es el private equity?"],
                "responses": ["El private equity es capital invertido en empresas privadas no cotizadas, con el objetivo de mejorar su valor y eventualmente venderlas con ganancias."]
              },
              {
                "tag": "Venture capital",
                "patterns": ["¿Qué es el venture capital?"],
                "responses": ["El venture capital es financiamiento proporcionado a startups y empresas emergentes con alto potencial de crecimiento a cambio de participación accionaria."]
              },
              {
                "tag": "Bootstrapping",
                "patterns": ["¿Qué es el bootstrapping?"],
                "responses": ["El bootstrapping es la práctica de iniciar y hacer crecer un negocio con recursos mínimos y sin financiamiento externo."]
              },
              {
                "tag": "Capital inicial",
                "patterns": ["¿Qué es el capital inicial?"],
                "responses": ["El capital inicial es el dinero necesario para lanzar un negocio y cubrir sus primeros gastos operativos."]
              },
              {
                "tag": "Capital semilla",
                "patterns": ["¿Qué es el capital semilla?"],
                "responses": ["El capital semilla es financiamiento temprano proporcionado a startups para desarrollar su producto y modelo de negocio."]
              },
              {
                "tag": "Préstamo puente",
                "patterns": ["¿Qué es un préstamo puente?"],
                "responses": ["Un préstamo puente es un financiamiento temporal utilizado para cubrir necesidades inmediatas de efectivo hasta obtener un financiamiento a largo plazo."]
              },
              {
                "tag": "Acciones preferentes",
                "patterns": ["¿Qué son las acciones preferentes?"],
                "responses": ["Las acciones preferentes son valores que ofrecen dividendos fijos y tienen prioridad sobre las acciones comunes en la distribución de ganancias."]
              },
              {
                "tag": "Fondos indexados",
                "patterns": ["¿Qué son los fondos indexados?"],
                "responses": ["Los fondos indexados son fondos de inversión que replican la composición y rendimiento de un índice de mercado específico."]
              },
              {
                "tag": "Fondos cotizados",
                "patterns": ["¿Qué son los fondos cotizados?"],
                "responses": ["Los fondos cotizados (ETF) son fondos de inversión que se negocian en bolsas de valores y siguen el rendimiento de un índice, sector o activo."]
              },
              {
                "tag": "Títulos de deuda",
                "patterns": ["¿Qué son los títulos de deuda?"],
                "responses": ["Los títulos de deuda son instrumentos financieros que representan un préstamo a una entidad, que debe ser reembolsado con intereses."]
              },
              {
                "tag": "Bonos convertibles",
                "patterns": ["¿Qué son los bonos convertibles?"],
                "responses": ["Los bonos convertibles son títulos de deuda que pueden convertirse en acciones de la empresa emisora bajo ciertas condiciones."]
              },
              {
                "tag": "Certificados de depósito",
                "patterns": ["¿Qué son los certificados de depósito?"],
                "responses": ["Los certificados de depósito son instrumentos financieros emitidos por bancos que ofrecen un rendimiento fijo por un periodo determinado."]
              },
              {
                "tag": "Letras del Tesoro",
                "patterns": ["¿Qué son las letras del Tesoro?"],
                "responses": ["Las letras del Tesoro son títulos de deuda a corto plazo emitidos por el gobierno para financiar sus necesidades de efectivo."]
              },
              {
                "tag": "Bonos corporativos",
                "patterns": ["¿Qué son los bonos corporativos?"],
                "responses": ["Los bonos corporativos son títulos de deuda emitidos por empresas para financiar sus operaciones y proyectos."]
              },
              {
                "tag": "Bonos municipales",
                "patterns": ["¿Qué son los bonos municipales?"],
                "responses": ["Los bonos municipales son títulos de deuda emitidos por gobiernos locales para financiar proyectos públicos."]
              },
              {
                "tag": "Bonos basura",
                "patterns": ["¿Qué son los bonos basura?"],
                "responses": ["Los bonos basura son títulos de deuda con alto riesgo de impago y por lo tanto ofrecen altos rendimientos."]
              },
              {
                "tag": "Subasta de bonos",
                "patterns": ["¿Qué es una subasta de bonos?"],
                "responses": ["Una subasta de bonos es un proceso mediante el cual el gobierno o empresas venden bonos al mejor postor."]
              },
              {
                "tag": "Eurobonos",
                "patterns": ["¿Qué son los Eurobonos?"],
                "responses": ["Los Eurobonos son bonos emitidos fuera del país en cuya moneda se denominan, y se colocan internacionalmente."]
              },
              {
                "tag": "Divisas",
                "patterns": ["¿Qué son las divisas?"],
                "responses": ["Las divisas son monedas extranjeras utilizadas como medio de intercambio internacional."]
              },
              {
                "tag": "Tipo de cambio",
                "patterns": ["¿Qué es el tipo de cambio?"],
                "responses": ["El tipo de cambio es el precio relativo de una moneda frente a otra, determinado por el mercado de divisas."]
              },
              {
                "tag": "Hiperinflación",
                "patterns": ["¿Qué es la hiperinflación?"],
                "responses": ["La hiperinflación es un aumento descontrolado y extremo de los precios en una economía, erosionando el valor de la moneda de manera rápida y drástica."]
              },
              {
                "tag": "Ajuste por inflación",
                "patterns": ["¿Qué es el ajuste por inflación?"],
                "responses": ["El ajuste por inflación es un proceso contable que corrige los estados financieros para reflejar los efectos de la inflación en el poder adquisitivo."]
              },
              {
                "tag": "Desinflación",
                "patterns": ["¿Qué es la desinflación?"],
                "responses": ["La desinflación es la reducción gradual de la tasa de inflación, es decir, una disminución en el ritmo al que los precios aumentan."]
              },
              {
                "tag": "Economía de escala",
                "patterns": ["¿Qué es la economía de escala?"],
                "responses": ["La economía de escala se refiere a la reducción de costos unitarios que una empresa obtiene al aumentar la producción o la escala de operaciones."]
              },
              {
                "tag": "Economía de alcance",
                "patterns": ["¿Qué es la economía de alcance?"],
                "responses": ["La economía de alcance se refiere a la reducción de costos que una empresa obtiene al producir múltiples productos usando recursos comunes."]
              },
              {
                "tag": "Valor temporal del dinero",
                "patterns": ["¿Qué es el valor temporal del dinero?"],
                "responses": ["El valor temporal del dinero es el concepto financiero que establece que el dinero disponible en el presente es más valioso que la misma cantidad en el futuro, debido a su capacidad de generar rendimientos o intereses."]
              },
              {
                "tag": "Superintendencia",
                "patterns": ["¿Qué es la Superintendencia de Bancos?"],
                "responses": ["De acuerdo al Artículo 19 de la Ley No. 183–02, Mon­e­taria y Financiera del 21 de noviembre de 2002, la Super­in­ten­den­cia de Ban­cos tiene por fun­ción: “realizar, con plena autonomía fun­cional, la super­visión de las enti­dades de inter­me­diación financiera, con el objeto de ver­i­ficar el cumplim­iento por parte de dichas enti­dades de lo dis­puesto en esta Ley, Reglamen­tos, Instruc­tivos y Cir­cu­lares; requerir la con­sti­tu­ción de pro­vi­siones para cubrir ries­gos; exi­gir la reg­u­lar­ización de los incumplim­ien­tos a las dis­posi­ciones legales y reglamen­tarias vigentes; e imponer las cor­re­spon­di­entes san­ciones, a excep­ción de las que aplique el Banco Cen­tral en vir­tud de la citada ley."]
            
              },
              {
                "tag": ["Prestaciones Laborales"],
                "patterns": ["¿Qué son las prestaciones laborales?"],
                "responses": ["Todo trabajador en República Dominicana tiene el derecho y la obligación de estar afiliado a una AFP o administradora de fondos de pensiones, así como al SFS o Seguro Familiar de Salud. Tal como lo indica la Ley de Seguridad Social (87-01), el Sistema Dominicano de Seguridad Social (SDSS) se basa en un sistema único de afiliación, cotización, plan de beneficios y prestaciones de servicios. Igualmente sucede con el registro previsional, que integra a los beneficiarios de todas las cajas y planes de pensión existentes. Una vez que te encuentras afiliado, realizarás un aporte mensual para ambas prestaciones. Este monto por prestaciones sociales es un pequeño porcentaje que se deduce de tu salario ordinario y bonificaciones (no se incluyen las horas extras). Otra parte del aporte lo realiza tu empleador o patrono. Estos fondos son recaudados y administrados por la Tesorería de la Seguridad Social (TSS)."]
              },
              {
                  "tag":["Tipos de Prestaciones Laborales"],
                  "patters":["¿Qué tipos de prestaciones laborales existen?"],
                  "responses":[
                    "1. Salario\nEl pago regular que el empleado recibe por su trabajo. Puede ser semanal, quincenal o mensual.\n\n2. Vacaciones\nLos empleados tienen derecho a un período de vacaciones remuneradas de 14 días laborables por cada año de servicio continuo. Después de cinco años de servicio continuo, el empleado tiene derecho a 18 días laborables de vacaciones.\n\n3. Doble Sueldo (Salario de Navidad)\nLos empleados tienen derecho a un salario adicional en el mes de diciembre, conocido como 'décimo tercer salario' o 'salario de Navidad'. Este es equivalente a una doceava parte del salario devengado durante el año calendario.\n\n4. Participación en las Utilidades (Bonificación)\nLas empresas deben distribuir el 10% de sus beneficios netos anuales entre sus empleados. Este monto se divide entre todos los empleados en proporción al salario devengado durante el año. La bonificación tiene un tope máximo equivalente a 45 días de salario para empleados ordinarios y 60 días de salario para empleados de larga duración.\n\n5. Preaviso\nEn caso de terminación del contrato de trabajo sin causa justificada, el empleador debe dar un preaviso al empleado. La duración del preaviso depende del tiempo que el empleado ha trabajado en la empresa:\n\nDe 3 a 6 meses: 7 días de preaviso.\nDe 6 meses a un año: 14 días de preaviso.\nMás de un año: 28 días de preaviso.\n\n6. Cesantía\nSi un empleado es despedido sin causa justificada después de haber trabajado por más de tres meses, tiene derecho a una indemnización por cesantía. El monto de la cesantía depende del tiempo de servicio:\n\nDe 3 a 6 meses: 6 días de salario.\nDe 6 meses a un año: 13 días de salario.\nDe 1 a 5 años: 21 días de salario por cada año de servicio.\nMás de 5 años: 23 días de salario por cada año de servicio.\n\n7. Subsidio por Enfermedad y Maternidad\nLas trabajadoras tienen derecho a un permiso de maternidad de 14 semanas (6 semanas antes del parto y 8 semanas después). Durante este período, la Seguridad Social cubre un porcentaje del salario de la empleada. Los empleados también tienen derecho a subsidios por enfermedad que cubren una parte de su salario durante el tiempo que estén incapacitados para trabajar.\n\n8. Seguro Familiar de Salud (SFS)\nParte de la Seguridad Social, el SFS proporciona cobertura médica a los empleados y sus dependientes. Tanto el empleador como el empleado contribuyen a este seguro.\n\n9. Administradora de Fondos de Pensiones (AFP)\nLos empleados y empleadores contribuyen a un fondo de pensiones que asegura una pensión de jubilación para el empleado al final de su vida laboral.\n\n10. Otros Beneficios\nDependiendo de la empresa y del contrato individual, pueden existir otros beneficios como bonos de desempeño, transporte, alimentación, educación, entre otros.\n\nEstas prestaciones laborales están diseñadas para proteger los derechos de los empleados y asegurar un ambiente de trabajo justo y equitativo. Es importante que tanto empleadores como empleados conozcan y respeten estas disposiciones legales."]
                  }
        
  
  ]
}
